org-manual.org
#+TITLE: Traduction française du [[https://orgmode.org/org.pdf][manuel Org]]
#+AUTHOR: Laurent Garnier

#+LANGUAGE: FR
#+OPTIONS: toc:t h:3 num:t
* Introduction 
** Résumé

   Org est un mode pour prendre des notes, gérer des listes de choses
   à faire, et plannifier des projets avec un système de texte brut
   rapide et efficace. C'est aussi un système pour écrire avec un
   soutien unique pour la programmation littérale et la recherche
   reproductible. 

   Org est implémenté par dessus le mode Outline (contour), ce qui
   rend possible de conserver des fichiers de grande taille bien
   structurés. La visibilité des cycles et la structure d'édition
   aident à travailler avec des arbres. Les tableaux sont facilement
   créés avec un éditeur de table intégré. Les liens en texte brut du
   style URL connectent aux sites web, emails, messages Usenet,
   entrées BBDB, et tout fichier relié aux projets. 

   Org développe l'organisation des tâches autour des fichiers de
   notes qui contiennent des listes ou des informations à propos des
   projets comme texte brut. La plannification de projet et la gestion
   de tâche font usage de méta-données qui font partie d'un noeud de
   contour. Basées sur ces données, des entrées spécifiques peuvent
   être extraites en requêtes et créer des /vues d'agenda/ dynamiques
   qui intègrent également le calendrier Emacs et le quotidien. Org
   peut être utilisé pour implémenter de nombreux schémas de projets
   différents, tels que le système GTD de David Allen.

   Les fichiers Org peuvent servir de simple système d'écriture avec
   l'exportation en de nombreux formats tels que HTML, \LaTeX, Open
   Document, et Markdown. De nouvelles options d'exportations peuvent
   être dérivées de celles existantes, ou définies à partir de zéro.

   Les fichiers Org peuvent inclure des blocs de code source, ce qui
   rend Org parfaitement adapté pour l'écriture de documents
   techniques avec des exemples de codes. Les blocs de code source Org
   sont pleinement fonctionnels, ils peuvent être évalués en place et
   leurs résultats peuvent être capturés dans le fichier. Cela rend
   possible de créer un simple fichier de recherche reproductible
   compendium.

   Org garde les choses simples. Lorsque découvert pour la première
   fois, il devrait sembler comme un contourneur direct et facile à
   utiliser. La complexité n'est pas imposée, mais une foison
   d'options est disponible si besoin. Org est une boîte à outils. De
   nombreux utilisateurs exécutent seulement une fraction (très
   personnelle) des capacités de Org, et savent qu'il y a plus s'ils
   en ont besoin. 

   Tout cela est réalisé avec des fichiers de texte brut, le format de
   fichier le plus portable. Org tourne dans Emacs. Emacs est l'un des
   programmes les plus largement portés, de sorte que le mode Org est
   disponible sur toutes les plateformes majeures. 

   Il y a un site web sur Org qui fournit des liens pour les nouvelles
   versions de Org, autant que des informations supplémentaires, FAQ,
   des liens vers des tutoriels, etc. Cette page est située à
   [[https://orgmode.org]]

   Une version antérieur (7.3) de ce manuel est disponible en version
   papier depuis Network Theory Ltd.

** Installation
   Org fait partie des récentes distributions de GNU Emacs, donc
   normalement vous n'avez pas besoin de l'installer.

   Si, pour une raison ou pour une autre, vous voulez installer Org
   par-dessus cette version pré-paquetée, il y a trois façons de le
   faire :
   + En utilisant le système de paquets Emacs.
   + En téléchargeant Org comme une archive.
   + En utilisant le dépôt git Org.

   Nous *recommandons fortement* de s'en tenir à une seule méthode
   d'installation. 

*** Utiliser le système de paquetage Emacs   

    Les distributions Emacs récentes incluent un système de paquetage
    qui vous laisse installer des bibliothèques Elisp.

    Vous pouvez installer Org avec =M-x package-install RET org=.

    *Important* : vous devez faire ça dans une session durant laquelle
     aucun fichier =.org= n'a été visité, i.e, où aucune fonction
     intégrée Org n'a été chargée. Autrement les fonctions Org
     d'autochargement ficheront l'installation en l'air. 

     Ensuite, pour être sûr que votre configuration Org est prise en
     compte, initialiser le système de paquets avec
     =(package-initialize)= dans votre fichier init Emacs avant de
     configurer n'importe quelle option Org. Si vous souhaitez
     utiliser le paquet Org du dépôt, vérifiez la page Org ELPA.

*** Télécharger Org comme une archive

    Vous pouvez télécharger la dernière version Org depuis le site web
    de Org. Dans ce cas, assurez-vous d'avoir configuré correctement
    le chemin de chargement dans votre fichier init :

    #+BEGIN_SRC emacs-lisp
      (add-to-list 'load-path "~/path/to/orgdir/lisp")
    #+END_SRC

    L'archive téléchargée contient des bibliothèques contribuées qui
    ne sont pas inclues dans Emacs. 

    Si vous voulez les utiliser, ajouter le répertoire =contrib= à
    votre chemin de chargement :
    #+BEGIN_SRC emacs-lisp
      (add-to-list 'load-path "~/path/to/orgdir/contrib/lisp" t)
    #+END_SRC

    Optionnellement, vous pouvez compiler les fichiers et/ou les
    installer sur votre système. Lancez =make help= pour lister les
    options de compilation et d'installation.

*** Utiliser le dépôt git de Org
    
    Vous pouvez cloner le dépôt de Org et installer Org comme ça :
    #+BEGIN_SRC sh
      cd ~/src/
      git clone https://code.orgmode.org/bzg/org-mode.git
      cd org-mode/
      make autoloads
    #+END_SRC

    Notez que dans ce cas, =make autoloads= est requis : cela définit
    la version de Org dans =org-version.el= et l'auto-chargement de
    Org dans =org-loaddefs.el=.

    Rappelez-vous d'ajouter le bon chemin de chargement comme décrit
    dans la méthode ci-dessus.
    
    Vous pouvez aussi compiler avec =make=, générer la documentation
    avec =make doc=, créer une configuration locale avec =make config=
    et installer Org avec =make install=. Prière de lancer =make help=
    pour obtenir la liste des options de compilation/installation.

    Pour plus d'explications détaillées sur le système de construction
    Org, merci de vérifier la page Org Build System sur Worg.
