org-manual.html
<!doctype html>
<html lang="FR">
<head>
<title>Traduction française du manuel Org</title>
<!-- 2019-02-07 Thu 10:40 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Laurent Garnier">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Traduction française du manuel Org</h1>

<form action="https://laurentgarnier.podia.com/email_lists/20100/subscriptions" accept-charset="UTF-8" method="post"><input name="utf8" type="hidden" value="✓" />
<input type="email" name="email" required="required" placeholder="Email" />
<input type="submit" value="Sign me up!" />
</form>

	
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Résumé</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Org est un mode pour prendre des notes, gérer des listes de choses
à faire, et plannifier des projets avec un système de texte brut
rapide et efficace. C'est aussi un système pour écrire avec un
soutien unique pour la programmation littérale et la recherche
reproductible. 
</p>

<p>
Org est implémenté par dessus le mode Outline (contour), ce qui
rend possible de conserver des fichiers de grande taille bien
structurés. La visibilité des cycles et la structure d'édition
aident à travailler avec des arbres. Les tableaux sont facilement
créés avec un éditeur de table intégré. Les liens en texte brut du
style URL connectent aux sites web, emails, messages Usenet,
entrées BBDB, et tout fichier relié aux projets. 
</p>

<p>
Org développe l'organisation des tâches autour des fichiers de
notes qui contiennent des listes ou des informations à propos des
projets comme texte brut. La plannification de projet et la gestion
de tâche font usage de méta-données qui font partie d'un noeud de
contour. Basées sur ces données, des entrées spécifiques peuvent
être extraites en requêtes et créer des <i>vues d'agenda</i> dynamiques
qui intègrent également le calendrier Emacs et le quotidien. Org
peut être utilisé pour implémenter de nombreux schémas de projets
différents, tels que le système GTD de David Allen.
</p>

<p>
Les fichiers Org peuvent servir de simple système d'écriture avec
l'exportation en de nombreux formats tels que HTML, \LaTeX, Open
Document, et Markdown. De nouvelles options d'exportations peuvent
être dérivées de celles existantes, ou définies à partir de zéro.
</p>

<p>
Les fichiers Org peuvent inclure des blocs de code source, ce qui
rend Org parfaitement adapté pour l'écriture de documents
techniques avec des exemples de codes. Les blocs de code source Org
sont pleinement fonctionnels, ils peuvent être évalués en place et
leurs résultats peuvent être capturés dans le fichier. Cela rend
possible de créer un simple fichier de recherche reproductible
compendium.
</p>

<p>
Org garde les choses simples. Lorsque découvert pour la première
fois, il devrait sembler comme un contourneur direct et facile à
utiliser. La complexité n'est pas imposée, mais une foison
d'options est disponible si besoin. Org est une boîte à outils. De
nombreux utilisateurs exécutent seulement une fraction (très
personnelle) des capacités de Org, et savent qu'il y a plus s'ils
en ont besoin. 
</p>

<p>
Tout cela est réalisé avec des fichiers de texte brut, le format de
fichier le plus portable. Org tourne dans Emacs. Emacs est l'un des
programmes les plus largement portés, de sorte que le mode Org est
disponible sur toutes les plateformes majeures. 
</p>

<p>
Il y a un site web sur Org qui fournit des liens pour les nouvelles
versions de Org, autant que des informations supplémentaires, FAQ,
des liens vers des tutoriels, etc. Cette page est située à
<a href="https://orgmode.org">https://orgmode.org</a>
</p>

<p>
Une version antérieur (7.3) de ce manuel est disponible en version
papier depuis Network Theory Ltd.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Installation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Org fait partie des récentes distributions de GNU Emacs, donc
normalement vous n'avez pas besoin de l'installer.
</p>

<p>
Si, pour une raison ou pour une autre, vous voulez installer Org
par-dessus cette version pré-paquetée, il y a trois façons de le
faire :
</p>
<ul class="org-ul">
<li>En utilisant le système de paquets Emacs.
</li>
<li>En téléchargeant Org comme une archive.
</li>
<li>En utilisant le dépôt git Org.
</li>
</ul>

<p>
Nous <b>recommandons fortement</b> de s'en tenir à une seule méthode
d'installation. 
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Utiliser le système de paquetage Emacs</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Les distributions Emacs récentes incluent un système de paquetage
qui vous laisse installer des bibliothèques Elisp.
</p>

<p>
Vous pouvez installer Org avec <code>M-x package-install RET org</code>.
</p>

<p>
<b>Important</b> : vous devez faire ça dans une session durant laquelle
 aucun fichier <code>.org</code> n'a été visité, i.e, où aucune fonction
 intégrée Org n'a été chargée. Autrement les fonctions Org
 d'autochargement ficheront l'installation en l'air. 
</p>

<p>
Ensuite, pour être sûr que votre configuration Org est prise en
compte, initialiser le système de paquets avec
<code>(package-initialize)</code> dans votre fichier init Emacs avant de
configurer n'importe quelle option Org. Si vous souhaitez
utiliser le paquet Org du dépôt, vérifiez la page Org ELPA.
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Télécharger Org comme une archive</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Vous pouvez télécharger la dernière version Org depuis le site web
de Org. Dans ce cas, assurez-vous d'avoir configuré correctement
le chemin de chargement dans votre fichier init :
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path "~/path/to/orgdir/lisp")
</pre>
</div>

<p>
L'archive téléchargée contient des bibliothèques contribuées qui
ne sont pas inclues dans Emacs. 
</p>

<p>
Si vous voulez les utiliser, ajouter le répertoire <code>contrib</code> à
votre chemin de chargement :
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path "~/path/to/orgdir/contrib/lisp" t)
</pre>
</div>

<p>
Optionnellement, vous pouvez compiler les fichiers et/ou les
installer sur votre système. Lancez <code>make help</code> pour lister les
options de compilation et d'installation.
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Utiliser le dépôt git de Org</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Vous pouvez cloner le dépôt de Org et installer Org comme ça :
</p>
<div class="org-src-container">

<pre class="src src-sh">cd ~/src/
git clone https://code.orgmode.org/bzg/org-mode.git
cd org-mode/
make autoloads
</pre>
</div>

<p>
Notez que dans ce cas, <code>make autoloads</code> est requis : cela définit
la version de Org dans <code>org-version.el</code> et l'auto-chargement de
Org dans <code>org-loaddefs.el</code>.
</p>

<p>
Rappelez-vous d'ajouter le bon chemin de chargement comme décrit
dans la méthode ci-dessus.
</p>

<p>
Vous pouvez aussi compiler avec <code>make</code>, générer la documentation
avec <code>make doc</code>, créer une configuration locale avec <code>make config</code>
et installer Org avec <code>make install</code>. Prière de lancer <code>make help</code>
pour obtenir la liste des options de compilation/installation.
</p>

<p>
Pour plus d'explications détaillées sur le système de construction
Org, merci de vérifier la page Org Build System sur Worg.
</p>
</div>
</div>
</div>
