org-manual.org
** Activation
   
   Les tampons du mode Org nécessitent que le verrouillage de police
   soit activé : c'est le cas par défaut dans Emacs[fn:1]. 

   Il y a des problèmes de compatibilité entre le mode Org et d'autres
   paquets Elisp, merci de prendre le temps de vérifier la liste (voir
   Section 15.10.2 [Conflicts], page 239).

   Les quatres commandes Org =org-store-link=, =org-capture=,
   =org-agenda=, et =org-switchb= devraient être accessible via les
   touches globales (i.e, n'importe où dans Emacs, pas seulement dans
   les tampons Org). 

   Voici quelques suggestions de combinaisons pour ces touches, merci de
   modifier les touches avec vos propres liaisons :
   #+BEGIN_SRC emacs-lisp
     (global-set-key "\C-cl" 'org-store-link)
     (global-set-key "\C-ca" 'org-agenda)
     (global-set-key "\C-cc" 'org-capture)
     (global-set-key "\C-cb" 'org-switchb)
   #+END_SRC

   Les fichiers avec l'extension =.org= utilisent le mode Org par
   défaut. Pour déclencher le mode Org dans un fichier qui n'a pas
   l'extension =.org=, faire en sorte que la première ligne du fichier
   ressemble à ça :
   =MY PROJECTS     -*- mode: org; -*-=
   ce qui sélectionnera le mode Org pour ce tampon peu importe le nom
   du fichier. Voir aussi la variable
   =org-insert-mode-line-in-empty-file=.

   De nombreuses commandes dans Org fonctionnent sur la région si la
   région est /active/. Pour faire usage de cela, vous devez avoir
   activé =transient-mark-mode=, ce qui est le cas par défaut. Si vous
   n'aimez pas =transient-mark-mode=, vous pouvez créer une région
   active en utilisant la souris pour sélectionner une région, ou en
   pressant =C-SPC= deux fois avant de déplacer le curseur.
** Retours (Feedback)
   
   Si vous rencontrez des problèmes avec Org, ou si vous avez des
   questions, remarques, ou idées à son propos, merci d'écrire à la
   liste de diffusion de Org =[[emacs-orgmode@gnu.org]]=. Vous pouvez vous
   inscrire à la liste sur cette page. Si vous n'êtes pas un membre de
   la liste de diffusion, votre courrier sera transmis après qu'un
   modérateur l'ait approuvé[fn:2].

   Pour reporter des bugs, merci d'essayer d'abord de reproduire le
   bug avec la dernière version de Org disponible--si vous lancez une
   version périmée, c'est très possible que le bug ait déjà été
   résolu. Si le bug persiste, préparez un rapport et fournissez
   autant d'information que possible, incluant les informations de
   version de Emacs (=M-x emacs-version RET=) et Org (=M-x org-version
   RET=), autant que la configuration Org reliée au fichier init
   Emacs. La façon la plus simple de faire ça est d'utiliser la
   commande =M-x org-submit-bug-report RET= qui mettra toute cette
   information dans un tampon mail Emacs de sorte que vous n'avez qu'à
   ajouter votre description. Si vous n'envoyez pas d'e-mail depuis
   Emacs, merci de copier-coller le contenu dans votre programme
   d'e-mail.

   Parfois vous pourriez faire face à un problème dû à une erreur dans
   votre configuration Emacs ou Org. Avant de reporter un bug, c'est
   très utile de démarrer Emacs avec des personnalisations minimales
   et de reproduire le problème. Faire cela aide souvent à déterminer
   si le problème vient de votre personnalisation ou du mode Org
   lui-même. Vous pouvez démarrer une session minimale typique avec
   une commande comme l'exemple ci-dessous :
   #+BEGIN_SRC sh
     emacs -Q -l /path/to/minimal-org.el
   #+END_SRC
   Cependant si vous utilisez le mode Org tel que distribué avec
   Emacs, une configuration minimale n'est pas nécessaire. Dans ce cas
   c'est suffisant de démarrer Emacs avec =emacs -Q=. Le fichier de
   configuration =minimal-org.el= peut avoir des contenus comme montré
   ci-dessous :
   #+BEGIN_SRC emacs-lisp
     ;;; Minimal setup to load latest 'org-mode'

     ;; activate debugging
     (setq debug-on-error t
	   debug-on-signal nil
	   debug-on-quit nil)

     ;; add latest org-mode to load path
     (add-to-list 'load-path "/path/to/org-mode/lisp")
     (add-to-list 'load-path "/path/to/org-mode/contrib/lisp" t)
   #+END_SRC

   Si une erreur survient, un /backtrace/ peut être très utile (voir
   ci-dessous pour comment en créer un). Souvent un petit fichier
   d'exemple aide, avec des informations claires à propos de :
   1. Qu'avez-vous fait exactement ?
   2. Qu'attendiez-vous qu'il se produise ?
   3. Que s'est-il produit à la place ?

   Merci d'aider à améliorer ce programme.
   
   
*** Comment créer un backtrace

    Si travailler avec Org produit une erreur avec un message que vous
    ne comprenez pas, vous avez peut-être tapé un bug. La meilleure
    façon de reporter ça c'est en fournissant, en plus de ce qui a été
    mentionné au-dessus, un /backtrace/. C'est de l'information depuis
    le débogueur intégré à propos de où et comment l'erreur est
    apparue. Voici comment produire un backtrace utile :
    1. Recharger les versions non compilées de tous les fichiers Lisp
       en mode Org. Le backtrace contient beaucoup plus d'informations
       s'il est produit avec du code non compilé. Pour faire ça,
       utiliser : =C-u M-x org-reload RET= ou sélectionnez 
       =Org -> Refresh/Reload -> Reload Org uncompiled= depuis le menu
    2. Aller dans le menu =Options= et sélectionnez =Enter Debugger on
       Error=
    3. Faites tout ce que vous avez à faire pour taper
       l'erreur. N'oubliez pas de documenter les étapes que vous
       suivez.
    4. Lorsque vous tapez l'erreur, un tampon =*Backtrace*= apparaîtra
       à l'écran. Enregistrez ce tampon dans un fichier (par exemple
       en utilisant =C-x C-w=) et attachez-le à votre report de bug.

** Conventions typographiques utilisées dans ce manuel
*** Mots-clés TODO, balises, propriétés, etc.   
    Org utilise principalement trois types de mots-clés : mots-clés
    TODO, noms de balises et noms de propriétés. Dans ce manuel nous
    utilisons les conventions suivantes :

    + TODO WAITING :: les mots-clés TODO sont écrits en capitales,
                      même si ils sont définis par l'utilisateur. 
    + boss ARCHIVE :: les balises définies par l'utilisateur sont
                      écrites en minuscule; les balises intégrées avec
                      un sens spécial sont écrites en capitales.
    + Release PRIORITY :: les propriétés définies par l'utilisateur
         sont en capitales; les propriétés intégrées avec une
         signification spéciale sont écrites en capitales.

	 

    De plus, Org utilise des mots-clés optionnels (comme =#+TITLE=
    pour configurer le titre) et des mots-clés environnement (comme
    =#+BEGIN_EXPORT html= pour démarrer un environnement HTML). Ils
    sont écrits en majuscules dans le manuel pour améliorer leur
    lisibilité, mais vous pouvez utiliser des minuscules dans votre
    fichier Org.
