org-manual.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Activation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Les tampons du mode Org nécessitent que le verrouillage de police
soit activé : c'est le cas par défaut dans Emacs<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. 
</p>

<p>
Il y a des problèmes de compatibilité entre le mode Org et d'autres
paquets Elisp, merci de prendre le temps de vérifier la liste (voir
Section 15.10.2 [Conflicts], page 239).
</p>

<p>
Les quatres commandes Org <code>org-store-link</code>, <code>org-capture</code>,
<code>org-agenda</code>, et <code>org-switchb</code> devraient être accessible via les
touches globales (i.e, n'importe où dans Emacs, pas seulement dans
les tampons Org). 
</p>

<p>
Voici quelques suggestions de combinaisons pour ces touches, merci de
modifier les touches avec vos propres liaisons :
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-switchb)
</pre>
</div>

<p>
Les fichiers avec l'extension <code>.org</code> utilisent le mode Org par
défaut. Pour déclencher le mode Org dans un fichier qui n'a pas
l'extension <code>.org</code>, faire en sorte que la première ligne du fichier
ressemble à ça :
<code>MY PROJECTS     -*- mode: org; -*-</code>
ce qui sélectionnera le mode Org pour ce tampon peu importe le nom
du fichier. Voir aussi la variable
<code>org-insert-mode-line-in-empty-file</code>.
</p>

<p>
De nombreuses commandes dans Org fonctionnent sur la région si la
région est <i>active</i>. Pour faire usage de cela, vous devez avoir
activé <code>transient-mark-mode</code>, ce qui est le cas par défaut. Si vous
n'aimez pas <code>transient-mark-mode</code>, vous pouvez créer une région
active en utilisant la souris pour sélectionner une région, ou en
pressant <code>C-SPC</code> deux fois avant de déplacer le curseur.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Retours (Feedback)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Si vous rencontrez des problèmes avec Org, ou si vous avez des
questions, remarques, ou idées à son propos, merci d'écrire à la
liste de diffusion de Org <code>[[emacs-orgmode@gnu.org]]</code>. Vous pouvez vous
inscrire à la liste sur cette page. Si vous n'êtes pas un membre de
la liste de diffusion, votre courrier sera transmis après qu'un
modérateur l'ait approuvé<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>

<p>
Pour reporter des bugs, merci d'essayer d'abord de reproduire le
bug avec la dernière version de Org disponible&#x2013;si vous lancez une
version périmée, c'est très possible que le bug ait déjà été
résolu. Si le bug persiste, préparez un rapport et fournissez
autant d'information que possible, incluant les informations de
version de Emacs (<code>M-x emacs-version RET</code>) et Org (<code>M-x org-version
   RET</code>), autant que la configuration Org reliée au fichier init
Emacs. La façon la plus simple de faire ça est d'utiliser la
commande <code>M-x org-submit-bug-report RET</code> qui mettra toute cette
information dans un tampon mail Emacs de sorte que vous n'avez qu'à
ajouter votre description. Si vous n'envoyez pas d'e-mail depuis
Emacs, merci de copier-coller le contenu dans votre programme
d'e-mail.
</p>

<p>
Parfois vous pourriez faire face à un problème dû à une erreur dans
votre configuration Emacs ou Org. Avant de reporter un bug, c'est
très utile de démarrer Emacs avec des personnalisations minimales
et de reproduire le problème. Faire cela aide souvent à déterminer
si le problème vient de votre personnalisation ou du mode Org
lui-même. Vous pouvez démarrer une session minimale typique avec
une commande comme l'exemple ci-dessous :
</p>
<div class="org-src-container">

<pre class="src src-sh">emacs -Q -l /path/to/minimal-org.el
</pre>
</div>
<p>
Cependant si vous utilisez le mode Org tel que distribué avec
Emacs, une configuration minimale n'est pas nécessaire. Dans ce cas
c'est suffisant de démarrer Emacs avec <code>emacs -Q</code>. Le fichier de
configuration <code>minimal-org.el</code> peut avoir des contenus comme montré
ci-dessous :
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;; Minimal setup to load latest 'org-mode'

;; activate debugging
(setq debug-on-error t
      debug-on-signal nil
      debug-on-quit nil)

;; add latest org-mode to load path
(add-to-list 'load-path "/path/to/org-mode/lisp")
(add-to-list 'load-path "/path/to/org-mode/contrib/lisp" t)
</pre>
</div>

<p>
Si une erreur survient, un <i>backtrace</i> peut être très utile (voir
ci-dessous pour comment en créer un). Souvent un petit fichier
d'exemple aide, avec des informations claires à propos de :
</p>
<ol class="org-ol">
<li>Qu'avez-vous fait exactement ?
</li>
<li>Qu'attendiez-vous qu'il se produise ?
</li>
<li>Que s'est-il produit à la place ?
</li>
</ol>

<p>
Merci d'aider à améliorer ce programme.
</p>
</div>


<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Comment créer un backtrace</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Si travailler avec Org produit une erreur avec un message que vous
ne comprenez pas, vous avez peut-être tapé un bug. La meilleure
façon de reporter ça c'est en fournissant, en plus de ce qui a été
mentionné au-dessus, un <i>backtrace</i>. C'est de l'information depuis
le débogueur intégré à propos de où et comment l'erreur est
apparue. Voici comment produire un backtrace utile :
</p>
<ol class="org-ol">
<li>Recharger les versions non compilées de tous les fichiers Lisp
en mode Org. Le backtrace contient beaucoup plus d'informations
s'il est produit avec du code non compilé. Pour faire ça,
utiliser : <code>C-u M-x org-reload RET</code> ou sélectionnez 
<code>Org -&gt; Refresh/Reload -&gt; Reload Org uncompiled</code> depuis le menu
</li>
<li>Aller dans le menu <code>Options</code> et sélectionnez <code>Enter Debugger on
       Error</code>
</li>
<li>Faites tout ce que vous avez à faire pour taper
l'erreur. N'oubliez pas de documenter les étapes que vous
suivez.
</li>
<li>Lorsque vous tapez l'erreur, un tampon <code>*Backtrace*</code> apparaîtra
à l'écran. Enregistrez ce tampon dans un fichier (par exemple
en utilisant <code>C-x C-w</code>) et attachez-le à votre report de bug.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Conventions typographiques utilisées dans ce manuel</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Mots-clés TODO, balises, propriétés, etc.</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Org utilise principalement trois types de mots-clés : mots-clés
TODO, noms de balises et noms de propriétés. Dans ce manuel nous
utilisons les conventions suivantes :
</p>

<dl class="org-dl">
<dt> TODO WAITING </dt><dd>les mots-clés TODO sont écrits en capitales,
même si ils sont définis par l'utilisateur. 
</dd>
<dt> boss ARCHIVE </dt><dd>les balises définies par l'utilisateur sont
écrites en minuscule; les balises intégrées avec
un sens spécial sont écrites en capitales.
</dd>
<dt> Release PRIORITY </dt><dd>les propriétés définies par l'utilisateur
sont en capitales; les propriétés intégrées avec une
signification spéciale sont écrites en capitales.
</dd>
</dl>



<p>
De plus, Org utilise des mots-clés optionnels (comme <code>#+TITLE</code>
pour configurer le titre) et des mots-clés environnement (comme
<code>#+BEGIN_EXPORT html</code> pour démarrer un environnement HTML). Ils
sont écrits en majuscules dans le manuel pour améliorer leur
lisibilité, mais vous pouvez utiliser des minuscules dans votre
fichier Org.
</p>
</div>
</div>
