org-manual.org
*** Combinaisons de touches et commandes
    Le manuel suggère quelques combinaisons de touches globales, en
    particulier =C-c= pour =org-agenda= et =C-c c= pour
    =org-capture=. Ce sont seulement des suggestions, mais le reste du
    manuel suppose que ces combinaisons de touches sont en place afin
    de lister les commandes par accès de touches. 

    Aussi, le manuel liste à la fois les touches et les commandes
    correspondantes pour accéder aux fonctionnalités. Le mode Org
    utilise souvent la même touche pour différentes fonctions, selon
    le contexte. La commande qui est liée à de telles touches a un nom
    générique, comme =org-metaright=. Dans le manuel nous donnerons, à
    chaque fois que possible, la fonction qui est appelée en interne
    par la commande générique. Par exemple, dans le chapitre sur la
    structure du document, =M-RIGHT= sera listée pour appeler
    =org-to-demote=, alors que dans le chapitre sur les tableaux, elle
    sera listée pour appeler =org-table-move-column-right=. Si vous
    préférez, vous pouvez compiler le manuel sans les noms de
    commandes en déconfigurant le drapeau =cmdnames= dans =org.texi=.
* Structure du document
  Org est basé sur le mode Outline et fournit des commandes pour
  éditer la structure du document. 
** Outlines (contours)

   Org est implémenté par-dessus le mode Outline. Les contours
   permettent à un document d'être organisé selon une structure
   hiérarchique, ce qui est (au moins pour moi), la meilleure
   représentation de notes et de pensées. Un aperçu de cette structure
   est obtenu en pliant (cachant) de grandes parties du document pour
   montrer uniquement la structure générale du document les parties en
   cours de travail. Org simplifie grandement l'usage de contours en
   compressant l'entière fonctionnalité montrer/cacher en une seule
   commande, =org-cycle=, qui est liée à la touche =TAB=.
** Headlines (en-têtes, rubriques)
   Les rubriques définissent la structure du contour d'un arbre. Les
   rubriques dans Org démarrent avec une ou plusieurs étoiles, sur la
   marge de gauche[fn:3]. Par exemple :
   #+BEGIN_SRC org
     ,* Top level headline
     ,** Second level
     ,*** 3rd level
	 some text
     ,*** 3rd level
	 more text


     ,* Another top level headline
   #+END_SRC

   Notez qu'une rubrique nommée après =org-footnote-section=, qui est
   par défaut reliée à ='Foonotes'=, est considérée comme spéciale. Un
   sous-arbre avec cette rubrique sera silencieusement ignoré par les
   fonctions d'exportation.

   Certaines personnes trouvent les nombreuses étoiles trop ennuyantes
   et préféreraient un contour avec des espaces blancs suivis d'une
   seule étoile comme début de rubrique. La section 15.8 [Clean view],
   page 235, décrit une configuration pour réaliser cela.

   Une ligne vide après la fin d'un sous-arbre est considéré comme en
   faisant partie et sera cachée lorsque le sous-arbre sera
   plié. Cependant, si vous laissez au moins deux lignes vierges, une
   ligne vierge restera visible après avoir plié le sous-arbre, afin
   de structurer la vue écrasée. Voir la variable
   =org-cycle-separator-lines= pour modifier ce comportement. 

** Cycle de visibilité
*** Cycle local et cycle global
    Les contours rendent possible de cacher des parties de texte dans
    le tampon. Org utilise juste deux commandes, liées à =TAB= et
    =S-TAB= pour changer la visibilité dans le tampon.

    + TAB :: =(org-cycle)= cycle du sous-arbre : tourne le sous-arbre
             actuel selon les états =FOLDED -> CHILDREN ->
             SUBTREE=. Le point doit être sur la rubrique pour que
             ça marche[fn:4].
    + S-TAB C-u TAB :: =(org-global-cycle)= cycle global : tourne le
                       tampon entier selon les états =OVERVIEW ->
                       CONTENTS -> SHOW ALL= 
                       Lorsque =S-TAB= est appelé avec un argument
                       numérique N préfixé, le du contenu à la
                       rubrique de niveau N devient visible. Notez que
                       dans les tableaux, =S-TAB= saute au champ
                       précédent. 

		       Vous pouvez lancer le cycle global en utilisant
                       =TAB= seulement si le point est au tout début
                       du tampon, mais pas sur une rubrique, et
                       =org-cycle-global-at-bob= est configuré à une
                       valeur non-=nil=.
    + C-u C-u TAB :: =(org-set-startup-visibility)= revient à la
                     visibilité du début du tampon (voir Section 2.3.2
                     [Initial visibility], page 8).
    + C-u C-u C-u TAB :: =(outline-show-all)= Montre tout, y compris
         les tiroirs.
    + C-c C-r :: =(org-reveal)= Révèle le contexte autour du point,
                 montrant l'entrée en cours, l'en-tête suivant et la
                 hiérarchie au-dessus. Utile pour travailler près d'un
                 emplacement qui a exposé à la commande d'arbre épars
                 (voir Section 2.6 [Sparse trees], page 11) ou une
                 commande d'agenda (voir Section 10.5 [Agenda
                 commands], page 115). Avec un argument préfixé
                 montre, sur chaque niveau, toutes les en-têtes
                 filles. Avec un argument préfixé double, montre aussi
                 le sous-arbre entier du parent. 
    + C-c C-k :: =(outline-show-branches)= Expose toutes les en-têtes
                 du sous-arbre, la vue du contenu d'un seul
                 sous-arbre.
    + C-c TAB :: =(outline-show-children)= Expose tous les enfants
                 directs du sous-arbre. Avec un argument numérique N
                 préfixé, expose tous les enfants jusqu'au niveau N.
    + C-c C-x b :: =(org-tree-to-indirect-buffer)= Montre le
                   sous-arbre actuel dans un tampon indirect[fn:5]. Avec un
                   argument numérique N préfixé, va au niveau N et
                   ensuite prend cet arbre. Si N est négatif alors
                   remonte de N niveaux. Avec un préfixe =C-u=, ne pas
                   retirer le tampon précédent indirectement utilisé.
    + C-c C-x v :: =(org-copy-visible)= Copie le texte /visible/ dans
                   la région dans le cycle du presse-papier.
