org-manual.html
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Combinaisons de touches et commandes</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Le manuel suggère quelques combinaisons de touches globales, en
particulier <code>C-c</code> pour <code>org-agenda</code> et <code>C-c c</code> pour
<code>org-capture</code>. Ce sont seulement des suggestions, mais le reste du
manuel suppose que ces combinaisons de touches sont en place afin
de lister les commandes par accès de touches. 
</p>

<p>
Aussi, le manuel liste à la fois les touches et les commandes
correspondantes pour accéder aux fonctionnalités. Le mode Org
utilise souvent la même touche pour différentes fonctions, selon
le contexte. La commande qui est liée à de telles touches a un nom
générique, comme <code>org-metaright</code>. Dans le manuel nous donnerons, à
chaque fois que possible, la fonction qui est appelée en interne
par la commande générique. Par exemple, dans le chapitre sur la
structure du document, <code>M-RIGHT</code> sera listée pour appeler
<code>org-to-demote</code>, alors que dans le chapitre sur les tableaux, elle
sera listée pour appeler <code>org-table-move-column-right</code>. Si vous
préférez, vous pouvez compiler le manuel sans les noms de
commandes en déconfigurant le drapeau <code>cmdnames</code> dans <code>org.texi</code>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Structure du document</h2>
<div class="outline-text-2" id="text-2">
<p>
Org est basé sur le mode Outline et fournit des commandes pour
éditer la structure du document. 
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Outlines (contours)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Org est implémenté par-dessus le mode Outline. Les contours
permettent à un document d'être organisé selon une structure
hiérarchique, ce qui est (au moins pour moi), la meilleure
représentation de notes et de pensées. Un aperçu de cette structure
est obtenu en pliant (cachant) de grandes parties du document pour
montrer uniquement la structure générale du document les parties en
cours de travail. Org simplifie grandement l'usage de contours en
compressant l'entière fonctionnalité montrer/cacher en une seule
commande, <code>org-cycle</code>, qui est liée à la touche <code>TAB</code>.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Headlines (en-têtes, rubriques)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Les rubriques définissent la structure du contour d'un arbre. Les
rubriques dans Org démarrent avec une ou plusieurs étoiles, sur la
marge de gauche<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>. Par exemple :
</p>
<div class="org-src-container">

<pre class="src src-org">* Top level headline
** Second level
*** 3rd level
    some text
*** 3rd level
    more text


* Another top level headline
</pre>
</div>

<p>
Notez qu'une rubrique nommée après <code>org-footnote-section</code>, qui est
par défaut reliée à <code>'Foonotes'</code>, est considérée comme spéciale. Un
sous-arbre avec cette rubrique sera silencieusement ignoré par les
fonctions d'exportation.
</p>

<p>
Certaines personnes trouvent les nombreuses étoiles trop ennuyantes
et préféreraient un contour avec des espaces blancs suivis d'une
seule étoile comme début de rubrique. La section 15.8 [Clean view],
page 235, décrit une configuration pour réaliser cela.
</p>

<p>
Une ligne vide après la fin d'un sous-arbre est considéré comme en
faisant partie et sera cachée lorsque le sous-arbre sera
plié. Cependant, si vous laissez au moins deux lignes vierges, une
ligne vierge restera visible après avoir plié le sous-arbre, afin
de structurer la vue écrasée. Voir la variable
<code>org-cycle-separator-lines</code> pour modifier ce comportement. 
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Cycle de visibilité</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Cycle local et cycle global</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Les contours rendent possible de cacher des parties de texte dans
le tampon. Org utilise juste deux commandes, liées à <code>TAB</code> et
<code>S-TAB</code> pour changer la visibilité dans le tampon.
</p>

<dl class="org-dl">
<dt> TAB </dt><dd><code>(org-cycle)</code> cycle du sous-arbre : tourne le sous-arbre
actuel selon les états <code>FOLDED -&gt; CHILDREN -&gt;
             SUBTREE</code>. Le point doit être sur la rubrique pour que
ça marche<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>.
</dd>
<dt> S-TAB C-u TAB </dt><dd><code>(org-global-cycle)</code> cycle global : tourne le
tampon entier selon les états <code>OVERVIEW -&gt;
                       CONTENTS -&gt; SHOW ALL</code> 
Lorsque <code>S-TAB</code> est appelé avec un argument
numérique N préfixé, le du contenu à la
rubrique de niveau N devient visible. Notez que
dans les tableaux, <code>S-TAB</code> saute au champ
précédent. 

<p>
Vous pouvez lancer le cycle global en utilisant
<code>TAB</code> seulement si le point est au tout début
du tampon, mais pas sur une rubrique, et
<code>org-cycle-global-at-bob</code> est configuré à une
valeur non-<code>nil</code>.
</p>
</dd>
<dt> C-u C-u TAB </dt><dd><code>(org-set-startup-visibility)</code> revient à la
visibilité du début du tampon (voir Section 2.3.2
[Initial visibility], page 8).
</dd>
<dt> C-u C-u C-u TAB </dt><dd><code>(outline-show-all)</code> Montre tout, y compris
les tiroirs.
</dd>
<dt> C-c C-r </dt><dd><code>(org-reveal)</code> Révèle le contexte autour du point,
montrant l'entrée en cours, l'en-tête suivant et la
hiérarchie au-dessus. Utile pour travailler près d'un
emplacement qui a exposé à la commande d'arbre épars
(voir Section 2.6 [Sparse trees], page 11) ou une
commande d'agenda (voir Section 10.5 [Agenda
commands], page 115). Avec un argument préfixé
montre, sur chaque niveau, toutes les en-têtes
filles. Avec un argument préfixé double, montre aussi
le sous-arbre entier du parent. 
</dd>
<dt> C-c C-k </dt><dd><code>(outline-show-branches)</code> Expose toutes les en-têtes
du sous-arbre, la vue du contenu d'un seul
sous-arbre.
</dd>
<dt> C-c TAB </dt><dd><code>(outline-show-children)</code> Expose tous les enfants
directs du sous-arbre. Avec un argument numérique N
préfixé, expose tous les enfants jusqu'au niveau N.
</dd>
<dt> C-c C-x b </dt><dd><code>(org-tree-to-indirect-buffer)</code> Montre le
sous-arbre actuel dans un tampon indirect<sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup>. Avec un
argument numérique N préfixé, va au niveau N et
ensuite prend cet arbre. Si N est négatif alors
remonte de N niveaux. Avec un préfixe <code>C-u</code>, ne pas
retirer le tampon précédent indirectement utilisé.
</dd>
<dt> C-c C-x v </dt><dd><code>(org-copy-visible)</code> Copie le texte <i>visible</i> dans
la région dans le cycle du presse-papier.
</dd>
</dl>
</div>
</div>
