org-manual.org
*** Visibilité initiale
    Lorsque Emacs visite un fichier Org pour la première fois, l'état
    global est configuré sur OVERVIEW, i.e, seulement les rubriques top
    niveau sont visibles[fn:6]. Cela peut être configuré via la variable
    =org-startup-folded=, sur la base d'un fichier-per en ajoutant
    l'une des lignes suivantes n'importe où dans le tampon :
    #+BEGIN_SRC org
      ,#+STARTUP: overview
      ,#+STARTUP: content
      ,#+STARTUP: showall
      ,#+STARTUP: showeverything
    #+END_SRC

    De plus, n'importe quelles entrées avec une propriété VISIBILITY
    (voir Chapter 7 [Properties and columns], page 64) verront leur
    visibilité adapté en conséquence. Les valeurs autorisées par cette
    propriétés sont =folded, children, content= et =all=.

    + C-u C-u TAB :: =(org-set-startup-visibility)= Reviens à la
                     visibilité du tampon, i.e, quoique ce soit qui
                     est requis par les options de démarrage les propriétés
                     VISIBILITY dans les entrées individuelles.

*** Attraper des éditions invisibles
    Parfois vous pouvez par inadvertance éditer éditer une partie
    invisible du tampon et être confus sur ce qui a été édité et comme
    annuler l'erreur. Configurer =org-catch-invisible-edits= à
    non-=edit= empêchera cela. Voir la docstring de cette option sur
    comment Org devrait attraper les édits invisible.  

** Déplacement
   Les commandes suivantes sautent vers d'autres rubriques dans le
   tampon

   + =C-c C-n= (=org-next-visible-heading=) :: prochaine rubrique
   + =C-c C-p= (=org-previous-visible-heading=) :: rubrique précédente
   + =C-c C-f= (=org-forward-same-level=) :: prochaine rubrique de
        même niveau
   + =C-c C-u= (=outline-up-heading=) :: retour vers une rubrique de
        niveau supérieur
   + =C-c C-j= (=org-goto=) :: saut vers un endroit différent sans
        modifier la visibilité du contour actuel. Montre la structure
        du document dans un tampon temporaire, où vous pouvez utiliser
        les touches suivantes pour trouver votre destination :
	+ =TAB= :: visibilité du cycle
        + =DOWN / UP= :: prochaine/précédente rubrique visible
        + =RET= :: choisir cet emplacement
        + =/= :: faire une recherche d'arbre épars
        
		 
        Les touches suivantes fonctionnent si vous désactivez
        =org-goto-auto-isearch=

        + =n / p= :: prochaine / précédente rubrique visible
        + =f / b= :: prochaine / précédente rubrique de même niveau
        + =u= :: un niveau plus haut
        + =0-9= :: argument numérique
        + =q= :: quitter 

        
        Voir aussi l'option =org-goto-interface=
          
