org-manual.html
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Visibilité initiale</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Lorsque Emacs visite un fichier Org pour la première fois, l'état
global est configuré sur OVERVIEW, i.e, seulement les rubriques top
niveau sont visibles<sup><a id="fnr.6" name="fnr.6" class="footref" href="#fn.6">6</a></sup>. Cela peut être configuré via la variable
<code>org-startup-folded</code>, sur la base d'un fichier-per en ajoutant
l'une des lignes suivantes n'importe où dans le tampon :
</p>
<div class="org-src-container">

<pre class="src src-org">#+STARTUP: overview
#+STARTUP: content
#+STARTUP: showall
#+STARTUP: showeverything
</pre>
</div>

<p>
De plus, n'importe quelles entrées avec une propriété VISIBILITY
(voir Chapter 7 [Properties and columns], page 64) verront leur
visibilité adapté en conséquence. Les valeurs autorisées par cette
propriétés sont <code>folded, children, content</code> et <code>all</code>.
</p>

<dl class="org-dl">
<dt> C-u C-u TAB </dt><dd><code>(org-set-startup-visibility)</code> Reviens à la
visibilité du tampon, i.e, quoique ce soit qui
est requis par les options de démarrage les propriétés
VISIBILITY dans les entrées individuelles.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> Attraper des éditions invisibles</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Parfois vous pouvez par inadvertance éditer éditer une partie
invisible du tampon et être confus sur ce qui a été édité et comme
annuler l'erreur. Configurer <code>org-catch-invisible-edits</code> à
non-<code>edit</code> empêchera cela. Voir la docstring de cette option sur
comment Org devrait attraper les édits invisible.  
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Déplacement</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Les commandes suivantes sautent vers d'autres rubriques dans le
tampon
</p>

<dl class="org-dl">
<dt> <code>C-c C-n</code> (<code>org-next-visible-heading</code>) </dt><dd>prochaine rubrique
</dd>
<dt> <code>C-c C-p</code> (<code>org-previous-visible-heading</code>) </dt><dd>rubrique précédente
</dd>
<dt> <code>C-c C-f</code> (<code>org-forward-same-level</code>) </dt><dd>prochaine rubrique de
même niveau
</dd>
<dt> <code>C-c C-u</code> (<code>outline-up-heading</code>) </dt><dd>retour vers une rubrique de
niveau supérieur
</dd>
<dt> <code>C-c C-j</code> (<code>org-goto</code>) </dt><dd>saut vers un endroit différent sans
modifier la visibilité du contour actuel. Montre la structure
du document dans un tampon temporaire, où vous pouvez utiliser
les touches suivantes pour trouver votre destination :
<dl class="org-dl">
<dt> <code>TAB</code> </dt><dd>visibilité du cycle
</dd>
<dt> <code>DOWN / UP</code> </dt><dd>prochaine/précédente rubrique visible
</dd>
<dt> <code>RET</code> </dt><dd>choisir cet emplacement
</dd>
<dt> <code>/</code> </dt><dd>faire une recherche d'arbre épars
</dd>
</dl>
</dd>
</dl>


<p>
Les touches suivantes fonctionnent si vous désactivez
<code>org-goto-auto-isearch</code>
</p>

<dl class="org-dl">
<dt> <code>n / p</code> </dt><dd>prochaine / précédente rubrique visible
</dd>
<dt> <code>f / b</code> </dt><dd>prochaine / précédente rubrique de même niveau
</dd>
<dt> <code>u</code> </dt><dd>un niveau plus haut
</dd>
<dt> <code>0-9</code> </dt><dd>argument numérique
</dd>
<dt> <code>q</code> </dt><dd>quitter 
</dd>
</dl>


<p>
Voir aussi l'option <code>org-goto-interface</code>
</p>
</div>
</div>
