org-manual.org
** Edition de la structure
   + =M-RET= (=org-meta-return=) :: insère une nouvelle rubrique 

     Si la commande est utilisée en début de ligne, et s'il y a une
        rubrique ou un élément de liste (voir Section 2.7 [Plain
        lists], page 12) au point, la nouvelle rubrique/élément est
        créée avant la ligne actuelle. Lorsqu'utilisé au début d'une
        ligne régulière d'un texte, transforme cette ligne en entête.
	Lorsque cette commande est utilisée au milieu d'une ligne, la
        ligne se sépare en deux et le reste de la ligne devient la
        nouvelle ligne d'entête. Si vous ne voulez pas que la ligne se
        sépare, personnalisez =org-M-RET-may-split-line=. 
	
	Appeler la commande avec un préfixe =C-u= insère une nouvelle
        rubrique à la fin de la sous-arborescence courante, tout en
        préservant son contenu. Avec un double préfixe =C-u C-u=, la
        nouvelle rubrique est créée à la fin du parent de la
        sous-arborescence à la place.
   + =C-RET= (=org-insert-heading-respect-content=) :: insère une
        nouvelle rubrique à la fin de la sous-arborescence actuelle. 
   + =M-S-RET= (=org-insert-todo-heading=) :: insère une nouvelle
        entrée TODO de même niveau que la rubrique en cours. Voir
        aussi la variable
        =org-treat-insert-todo-heading-as-state-change=.
   + =C-S-RET= (=org-insert-todo-heading-respect-content=) :: insère
        une nouvelle entrée TODO au même niveau que la rubrique en
        cours. Comme =C-RET=, la nouvelle rubrique est insérée après
        la sous-arboresence actuelle.
   + =TAB= (=org-cycle=) :: Dans une nouvelle entrée sans texte
        encore, le premier =TAB= rétrograde l'entrée pour en faire un
        enfant de la précédente. Le =TAB= suivant en fait un parent,
        et ainsi de suite, jusqu'au top niveau. Encore un autre =TAB=,
        et vous revenez au niveau initial.
   + =M-LEFT= (=org-do-promote=) :: Promeut la rubrique courante d'un
        niveau.
   + =M-RIGHT= (=org-do-demote=) :: Rétrograde la rubrique courante
        d'un niveau.
   + =M-S-LEFT= (=org-promote-subtree=) :: Promeut la
        sous-arborescence courante d'un niveau.
   + =M-S-RIGHT= (=org-demote-subtree=) :: Rétrograde la
        sous-arborescence courante d'un niveau.
   + =M-UP= (=org-move-subtree-up=) :: Remonte la sous-arborescence,
        /i.e/, échange avec la sous-arborescence précédente de même
        niveau.
   + =M-DOWN= (=org-move-subtree-down=) :: Descends la
        sous-arborescence, /i.e/, échange avec la sous-arborescence
        suivante de même niveau.
   + =C-c @= (=org-mark-subtree=) :: Marque la sous-arborescence au
        point. Tapé à plusieurs reprises marque les sous-arbres
        suivants de même niveau que la sous-arborescence marquée.
   + =C-c C-x C-w= (=org-cut-subtree=) :: Détruit la
        sous-arborescence, /i.e/, l'efface du tampon mais l'enregistre
        dans le cycle de destruction (kill ring). Avec un argument
        numérique préfixé N, détruit N sous-arborescences
        séquentiellement. 
   + =C-c C-x M-w= (=org-copy-subtree=) :: Copie la sous-arborescence
        dans le cycle de destruction (kill ring). Avec un argument
        numérique préfixé N, copie les N sous-arborescences
        séquentiellement. 
   + =C-c C-x C-y= (=org-paste-subtree=) :: Colle la sous-arborescence
        depuis le cycle de destruction (kill ring). Cela modifie le
        niveau de la sous-arborescence pour s'assurer que l'arbre
        rentre proprement à la position de colle. Le niveau de collage
        peut aussi être spécifiée avec un argument numérique préfixé,
        ou par collage après un marqueur de rubrique comme '=****='. 
   + =C-y= (=org-yank=) :: Selon les variables
        =org-yank-adjusted-subtrees= et =org-yank-folded-subtrees=, la
        commande interne Org =yank= colle les sous-arborescences
        pliées et d'une façon intelligente, utilise la même commande
        que =C-c C-x C-y=. Avec les paramétrages par défaut, aucun
        niveau d'ajustement n'a lieu, mais l'arbre collé est plié à
        moins que ce faisant ça avalerait du texte précédemment
        visible. Tout argument préfixé à cette commande force un
        =yank= normal à s'exécuter, avec le préfixe transmis. Une
        bonne façon de forcer un yank normal est =C-u C-y=. Si vous
        utilisez =yank-pop= après un yank, cela colle totalement les
        éléments détruit précédemment, sans ajustement ni pliage.
   + =C-c C-x c= (=org-clone-subtree-with-time-shift=) :: Clone un
        sous-arbre en en faisant plusieurs copies. Vous êtes invité à
        indiquer le nombre de copies à effectuer et vous pouvez
        également spécifier si des horodatages de l'entrée doivent
        être décalés.  Cela peut être utile, par exemple, pour créer
        un certain nombre de tâches liées à une série de conférences à
        préparer. Pour plus de détails, voir la documentation de la
        commande =org-clone-subtree-with-time-shift=.
   + =C-c C-w= (=org-refile=) :: Reclasse l'entrée ou la région à un
        endroit différent. Voir Section 9.5 [Refile and Copy]
   + =C-c ^= (=org-sort=) :: Tri les entrées de même
        niveau. Lorsqu'une région est activée, toutes les entrées dans
        la région sont triées. Autrement les enfants de la rubrique
        courante sont triés. La commande attend la méthode de tri, qui
        peut être alphabétiquement, numériquement, par date---premier
        horodatage avec actif préféré, date de création, date
        programmée, date de délai---par priorité, par mots-clés
        TODO---dans la suite les mots-clés ont été défini dans la
        configuration---ou par la valeur d'une propriété. Le tri
        inversé est possible aussi. Vous pouvez fournir votre propre
        fonction pour extraire la clé de tri. Avec un préfix =C-x=, le
        tri est sensible à la casse (majuscule, minuscule). 
   + =C-x n s= (=org-narrow-to-subtree=) :: Réduis le tampon à la
        sous-arborescence actuelle.
   + =C-x n b= (=org-narrow-to-block=) :: Réduis le tampon au bloc
        courant. 
   + =C-x n w= (=widen=) :: Elargit le tampon pour effacer la
        réduction.
   + =C-c *= (=org-toggle-heading=) :: Transforme une ligne normale ou
        une liste d'éléments en une rubrique---de sorte qu'il devienne
        une sous-rubrique à son emplacement. Transforme aussi une
        rubrique en une ligne normale en enlevant l'étoile. S'il y a
        une région active, transforme toutes les lignes dans la région
        en rubriques. Finalement, si la première ligne est une
        rubrique, efface les étoiles de toutes les rubriques dans la
        région. 


Lorsqu'il y a une région active---/i.e/, lorsque le mode Transient
Mark est actif---la promotion et la relégation marchent sur toutes les
rubriques de la région. Pour choisir une région de rubriques, c'est
mieux de placer à la fois le point et la marque au début d'une ligne,
la marque au début de la première rubrique, et le point à la ligne
juste après la dernière rubrique à changer. Notez que lorsque le point
est à l'intérieur d'un tableau (voir Chapitre 3 [Tableaux]), les
touches méta-curseur ont des fonctionnalités différentes. 
