org-manual.html

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Edition de la structure</h3>
<div class="outline-text-3" id="text-2-5">
<dl class="org-dl">
<dt> <code>M-RET</code> (<code>org-meta-return</code>) </dt><dd>insère une nouvelle rubrique 

<p>
Si la commande est utilisée en début de ligne, et s'il y a une
   rubrique ou un élément de liste (voir Section 2.7 [Plain
   lists], page 12) au point, la nouvelle rubrique/élément est
   créée avant la ligne actuelle. Lorsqu'utilisé au début d'une
   ligne régulière d'un texte, transforme cette ligne en entête.
   Lorsque cette commande est utilisée au milieu d'une ligne, la
   ligne se sépare en deux et le reste de la ligne devient la
   nouvelle ligne d'entête. Si vous ne voulez pas que la ligne se
   sépare, personnalisez <code>org-M-RET-may-split-line</code>. 
</p>

<p>
Appeler la commande avec un préfixe <code>C-u</code> insère une nouvelle
rubrique à la fin de la sous-arborescence courante, tout en
préservant son contenu. Avec un double préfixe <code>C-u C-u</code>, la
nouvelle rubrique est créée à la fin du parent de la
sous-arborescence à la place.
</p>
</dd>
<dt> <code>C-RET</code> (<code>org-insert-heading-respect-content</code>) </dt><dd>insère une
nouvelle rubrique à la fin de la sous-arborescence actuelle. 
</dd>
<dt> <code>M-S-RET</code> (<code>org-insert-todo-heading</code>) </dt><dd>insère une nouvelle
entrée TODO de même niveau que la rubrique en cours. Voir
aussi la variable
<code>org-treat-insert-todo-heading-as-state-change</code>.
</dd>
<dt> <code>C-S-RET</code> (<code>org-insert-todo-heading-respect-content</code>) </dt><dd>insère
une nouvelle entrée TODO au même niveau que la rubrique en
cours. Comme <code>C-RET</code>, la nouvelle rubrique est insérée après
la sous-arboresence actuelle.
</dd>
<dt> <code>TAB</code> (<code>org-cycle</code>) </dt><dd>Dans une nouvelle entrée sans texte
encore, le premier <code>TAB</code> rétrograde l'entrée pour en faire un
enfant de la précédente. Le <code>TAB</code> suivant en fait un parent,
et ainsi de suite, jusqu'au top niveau. Encore un autre <code>TAB</code>,
et vous revenez au niveau initial.
</dd>
<dt> <code>M-LEFT</code> (<code>org-do-promote</code>) </dt><dd>Promeut la rubrique courante d'un
niveau.
</dd>
<dt> <code>M-RIGHT</code> (<code>org-do-demote</code>) </dt><dd>Rétrograde la rubrique courante
d'un niveau.
</dd>
<dt> <code>M-S-LEFT</code> (<code>org-promote-subtree</code>) </dt><dd>Promeut la
sous-arborescence courante d'un niveau.
</dd>
<dt> <code>M-S-RIGHT</code> (<code>org-demote-subtree</code>) </dt><dd>Rétrograde la
sous-arborescence courante d'un niveau.
</dd>
<dt> <code>M-UP</code> (<code>org-move-subtree-up</code>) </dt><dd>Remonte la sous-arborescence,
<i>i.e</i>, échange avec la sous-arborescence précédente de même
niveau.
</dd>
<dt> <code>M-DOWN</code> (<code>org-move-subtree-down</code>) </dt><dd>Descends la
sous-arborescence, <i>i.e</i>, échange avec la sous-arborescence
suivante de même niveau.
</dd>
<dt> <code>C-c @</code> (<code>org-mark-subtree</code>) </dt><dd>Marque la sous-arborescence au
point. Tapé à plusieurs reprises marque les sous-arbres
suivants de même niveau que la sous-arborescence marquée.
</dd>
<dt> <code>C-c C-x C-w</code> (<code>org-cut-subtree</code>) </dt><dd>Détruit la
sous-arborescence, <i>i.e</i>, l'efface du tampon mais l'enregistre
dans le cycle de destruction (kill ring). Avec un argument
numérique préfixé N, détruit N sous-arborescences
séquentiellement. 
</dd>
<dt> <code>C-c C-x M-w</code> (<code>org-copy-subtree</code>) </dt><dd>Copie la sous-arborescence
dans le cycle de destruction (kill ring). Avec un argument
numérique préfixé N, copie les N sous-arborescences
séquentiellement. 
</dd>
<dt> <code>C-c C-x C-y</code> (<code>org-paste-subtree</code>) </dt><dd>Colle la sous-arborescence
depuis le cycle de destruction (kill ring). Cela modifie le
niveau de la sous-arborescence pour s'assurer que l'arbre
rentre proprement à la position de colle. Le niveau de collage
peut aussi être spécifiée avec un argument numérique préfixé,
ou par collage après un marqueur de rubrique comme '<code>****</code>'. 
</dd>
<dt> <code>C-y</code> (<code>org-yank</code>) </dt><dd>Selon les variables
<code>org-yank-adjusted-subtrees</code> et <code>org-yank-folded-subtrees</code>, la
commande interne Org <code>yank</code> colle les sous-arborescences
pliées et d'une façon intelligente, utilise la même commande
que <code>C-c C-x C-y</code>. Avec les paramétrages par défaut, aucun
niveau d'ajustement n'a lieu, mais l'arbre collé est plié à
moins que ce faisant ça avalerait du texte précédemment
visible. Tout argument préfixé à cette commande force un
<code>yank</code> normal à s'exécuter, avec le préfixe transmis. Une
bonne façon de forcer un yank normal est <code>C-u C-y</code>. Si vous
utilisez <code>yank-pop</code> après un yank, cela colle totalement les
éléments détruit précédemment, sans ajustement ni pliage.
</dd>
<dt> <code>C-c C-x c</code> (<code>org-clone-subtree-with-time-shift</code>) </dt><dd>Clone un
sous-arbre en en faisant plusieurs copies. Vous êtes invité à
indiquer le nombre de copies à effectuer et vous pouvez
également spécifier si des horodatages de l'entrée doivent
être décalés.  Cela peut être utile, par exemple, pour créer
un certain nombre de tâches liées à une série de conférences à
préparer. Pour plus de détails, voir la documentation de la
commande <code>org-clone-subtree-with-time-shift</code>.
</dd>
<dt> <code>C-c C-w</code> (<code>org-refile</code>) </dt><dd>Reclasse l'entrée ou la région à un
endroit différent. Voir Section 9.5 [Refile and Copy]
</dd>
<dt> <code>C-c ^</code> (<code>org-sort</code>) </dt><dd>Tri les entrées de même
niveau. Lorsqu'une région est activée, toutes les entrées dans
la région sont triées. Autrement les enfants de la rubrique
courante sont triés. La commande attend la méthode de tri, qui
peut être alphabétiquement, numériquement, par date&#x2014;premier
horodatage avec actif préféré, date de création, date
programmée, date de délai&#x2014;par priorité, par mots-clés
TODO&#x2014;dans la suite les mots-clés ont été défini dans la
configuration&#x2014;ou par la valeur d'une propriété. Le tri
inversé est possible aussi. Vous pouvez fournir votre propre
fonction pour extraire la clé de tri. Avec un préfix <code>C-x</code>, le
tri est sensible à la casse (majuscule, minuscule). 
</dd>
<dt> <code>C-x n s</code> (<code>org-narrow-to-subtree</code>) </dt><dd>Réduis le tampon à la
sous-arborescence actuelle.
</dd>
<dt> <code>C-x n b</code> (<code>org-narrow-to-block</code>) </dt><dd>Réduis le tampon au bloc
courant. 
</dd>
<dt> <code>C-x n w</code> (<code>widen</code>) </dt><dd>Elargit le tampon pour effacer la
réduction.
</dd>
<dt> <code>C-c *</code> (<code>org-toggle-heading</code>) </dt><dd>Transforme une ligne normale ou
une liste d'éléments en une rubrique&#x2014;de sorte qu'il devienne
une sous-rubrique à son emplacement. Transforme aussi une
rubrique en une ligne normale en enlevant l'étoile. S'il y a
une région active, transforme toutes les lignes dans la région
en rubriques. Finalement, si la première ligne est une
rubrique, efface les étoiles de toutes les rubriques dans la
région. 
</dd>
</dl>


<p>
Lorsqu'il y a une région active---<i>i.e</i>, lorsque le mode Transient
Mark est actif&#x2014;la promotion et la relégation marchent sur toutes les
rubriques de la région. Pour choisir une région de rubriques, c'est
mieux de placer à la fois le point et la marque au début d'une ligne,
la marque au début de la première rubrique, et le point à la ligne
juste après la dernière rubrique à changer. Notez que lorsque le point
est à l'intérieur d'un tableau (voir Chapitre 3 [Tableaux]), les
touches méta-curseur ont des fonctionnalités différentes. 
</p>
</div>
</div>
