org-manual.org
** Arbres clairsemés
   Une caractéristique importante du mode Org est la possibilité de
   construire des /arbres clairsemés/ pour les informations
   sélectionnées dans un arbre hiérarchique, de sorte que tout le
   document soit plié autant que possible, mais les informations
   sélectionnées sont rendues visibles avec la structure de titre
   au-dessus[fn:7]. Essayez-le juste et vous verrez comment ça
   marche. 

   Le mode Org contient plusieurs commandes pour créer de tels arbres,
   toutes ces commandes sont accessibles depuis un répartiteur :
   + =C-c /= (=org-sparse-tree=) :: Cela demande une touche
        supplémentaire pour sélectionner une commande de création
        d'arbre clairsemé. 
   + =C-c / r= ou =C-c / /= (=org-occur=) :: Demande une expression
        rationnelle (regexp) et affiche un arbre fragmenté avec toutes les
        correspondances. Si la correspondance est dans un titre, le
        titre est rendu visible. Si la correspondance est dans le
        corps d'une entrée, le titre et le corps sont rendus
        visibles. Afin de fournir un contexte minimal, la hiérarchie
        complète des titres au-dessus de la correspondance est
        affichée, ainsi que le titre suivant la correspondance. Chaque
        correspondance est également mise en évidence. les surbrillances
        disparaissent lorsque le tampon est modifié par une commande
        d'édition ou en appuyant sur =C-c C-c=[fn:8]. Lorsque appelée
        avec un argument préfixé =C-u=, les surbrillances précédentes
        sont conservées, ce qui permet d'empiler plusieurs appels à
        cette commande.
   + =M-g n= ou =M-g M-n= (=next-error=) :: Saute à la prochaine
        correspondance d'arbre clairsemé dans ce tampon. 
   + =M-g p= ou =M-g M-p= (=previous-error=) :: Saute à la précédente
        correspondance d'arbre dans ce tampon.

	
   Pour les arborescences éparses fréquemment utilisées de chaînes de
   recherche spécifiques, vous pouvez utiliser la variable
   =org-agenda-custom-custom-commands= pour définir un accès rapide au
   clavier à des arborescences éparses spécifiques. Ces commandes
   seront alors accessibles via le répartiteur de l'agenda (voir
   Section 10.2 [Agenda Dispatcher]). Par exemple :
   #+BEGIN_SRC emacs-lisp
     (setq org-agenda-custom-commands
	   '(("f" occur-tree "FIXME")))
   #+END_SRC
   définit la touche =f= comme un raccourci pour la création d'abre
   clairsemé correspondant à la chaîne '=FIXME='. 
   
   Les autres commandes d'arbres épars sélectionnent des rubriques
   basées sur les mots-clés TODO, des balises (tags), ou des
   propriétés et seront discutées plus tard dans ce manuel.

   Pour afficher un arbre épars, vous pouvez utiliser la commande
   Emacs =ps-print-buffer-with-faces= qui n'affiche pas les parties
   inivsibles du document. Ou vous pouvez utiliser la commande =C-c
   C-e v= pour exporter uniquement la partie visible du document et
   afficher le fichier résultant.

