org-manual.html
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Arbres clairsemés</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Une caractéristique importante du mode Org est la possibilité de
construire des <i>arbres clairsemés</i> pour les informations
sélectionnées dans un arbre hiérarchique, de sorte que tout le
document soit plié autant que possible, mais les informations
sélectionnées sont rendues visibles avec la structure de titre
au-dessus<sup><a id="fnr.7" name="fnr.7" class="footref" href="#fn.7">7</a></sup>. Essayez-le juste et vous verrez comment ça
marche. 
</p>

<p>
Le mode Org contient plusieurs commandes pour créer de tels arbres,
toutes ces commandes sont accessibles depuis un répartiteur :
</p>
<dl class="org-dl">
<dt> <code>C-c /</code> (<code>org-sparse-tree</code>) </dt><dd>Cela demande une touche
supplémentaire pour sélectionner une commande de création
d'arbre clairsemé. 
</dd>
<dt> <code>C-c / r</code> ou <code>C-c / /</code> (<code>org-occur</code>) </dt><dd>Demande une expression
rationnelle (regexp) et affiche un arbre fragmenté avec toutes les
correspondances. Si la correspondance est dans un titre, le
titre est rendu visible. Si la correspondance est dans le
corps d'une entrée, le titre et le corps sont rendus
visibles. Afin de fournir un contexte minimal, la hiérarchie
complète des titres au-dessus de la correspondance est
affichée, ainsi que le titre suivant la correspondance. Chaque
correspondance est également mise en évidence. les surbrillances
disparaissent lorsque le tampon est modifié par une commande
d'édition ou en appuyant sur <code>C-c C-c</code><sup><a id="fnr.8" name="fnr.8" class="footref" href="#fn.8">8</a></sup>. Lorsque appelée
avec un argument préfixé <code>C-u</code>, les surbrillances précédentes
sont conservées, ce qui permet d'empiler plusieurs appels à
cette commande.
</dd>
<dt> <code>M-g n</code> ou <code>M-g M-n</code> (<code>next-error</code>) </dt><dd>Saute à la prochaine
correspondance d'arbre clairsemé dans ce tampon. 
</dd>
<dt> <code>M-g p</code> ou <code>M-g M-p</code> (<code>previous-error</code>) </dt><dd>Saute à la précédente
correspondance d'arbre dans ce tampon.
</dd>
</dl>


<p>
Pour les arborescences éparses fréquemment utilisées de chaînes de
recherche spécifiques, vous pouvez utiliser la variable
<code>org-agenda-custom-custom-commands</code> pour définir un accès rapide au
clavier à des arborescences éparses spécifiques. Ces commandes
seront alors accessibles via le répartiteur de l'agenda (voir
Section 10.2 [Agenda Dispatcher]). Par exemple :
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-agenda-custom-commands
      '(("f" occur-tree "FIXME")))
</pre>
</div>
<p>
définit la touche <code>f</code> comme un raccourci pour la création d'abre
clairsemé correspondant à la chaîne '<code>FIXME</code>'. 
</p>

<p>
Les autres commandes d'arbres épars sélectionnent des rubriques
basées sur les mots-clés TODO, des balises (tags), ou des
propriétés et seront discutées plus tard dans ce manuel.
</p>

<p>
Pour afficher un arbre épars, vous pouvez utiliser la commande
Emacs <code>ps-print-buffer-with-faces</code> qui n'affiche pas les parties
inivsibles du document. Ou vous pouvez utiliser la commande <code>C-c
   C-e v</code> pour exporter uniquement la partie visible du document et
afficher le fichier résultant.
</p>
</div>
</div>
