org-manual.org
** Listes
   Dans une entrée de l'arborescence, des listes formatées à la main
   peuvent fournir une structure supplémentaire. Elles fournissent
   également un moyen de créer des listes de cases à cocher (voir
   Section 5.6 [Checkboxes]). Org soutient l'édition de telles listes,
   et chaque exportateur (voir Chapitre 12 [Exporting]) peut les
   analyser et les formater.

   Org connaît les listes ordonnées, les listes non-ordonnées, et les
   listes descriptives. 
   + Les éléments des listes non-ordonnées commencent par '=-=', '=+=', ou
     '=*='[fn:9] en tant que puces.
   + Les éléments des listes ordonnées commencent par un nombre suivi
     par soit un point ou une parenthèse droite[fn:10], tels que
     '=1.=', ou '=1)='[fn:11]. Si vous voulez
     qu'une liste commence avec une valeur différente---par exemple,
     20---commencez le texte avec '=[@20]='[fn:12]. Ces constructions
     peuvent être utilisées dans n'importe quel élément de la liste
     afin de renforcer une numérotation particulière. 
   + Les éléments des listes descriptives des éléments de listes
     non-ordonnées, et contiennent le séparateur '=::=' pour le
     /terme/ de description de la description.

     
   Les éléments appartenant à la même liste doivent avoir la même
   indentation sur la première ligne. En particulier, si une liste
   ordonnée atteint le nombre '=10.=', alors les nombres à 2 chiffres
   doivent être écrits alignés à gauche avec les autres nombres de la
   liste. Un élément finit avant la prohcaine ligne qui est moins ou
   également indentée que sa puce/son nombre.

   Une liste finit chaque fois que tous les éléments sont finis, ce
   qui signifie avant toute ligne moins ou également indentée que les
   éléments top niveau. Elle finit aussi avant deux lignes
   blanches. Dans ce cas, tous les éléments sont fermés. Voici un
   exemple :
   #+BEGIN_SRC org
     ,* Le seigneur des anneaux
     Mes scènes favorites sont (dans cet ordre)
     1. L'attaque de Rohirrim
     2. Le combat d'Eowyn avec le roi sorcier
	+ c'était déjà ma scène favorite dans le livre
	+ J'aime vraiment Miranda Otto. 
     3. Peter Jackson tiré par Legolas
	- dans le DVD seulement
	Il fait une tête vraiment amusante quand ça arrive.
     Mais au final, aucune scène individuelle ne compte mais le film dans
     son ensemble. 
     Acteurs majeurs dans ce film :
     - Elijah Wood :: Il joue Frodon
     - Sean Astin :: Il joue Sam, l'ami de Frodon. Je me rappelle encore
		     très bien de lui dans son rôle de Mikey Walsh dans
		     /les Goonies/.
   #+END_SRC
   Org prend en charge ces listes en ajustant les commandes de
   remplissage et d'habillage pour les traiter correctement et en les
   exportant correctement (voir Chapitre 12 [Exporting]). Puisque
   l'indentation est ce qui gouverne la structure de ces listes,
   beaucoup de constructions structurelles comme les blocs
   '=#+BEGIN_=' peuvent être indentés pour signaler leur appartenance
   à un élément particulier.

   Si vous trouvez qu'utiliser une puce différente pour une
   sous-liste---que celle utilisée pour le niveau de la liste
   courante---améliore la lisibilité, personnalisez la variable
   =org-list-demote-modify-bullet=.  Pour obtenir une différence plus
   importante d'indentation entre éléments et sous-éléments,
   personnaliser =org-list-indent-offset=.

   Les commandes suivantes agissent sur les éléments lorsque le point
   est dans la première ligne d'un élément---la ligne avec la puce ou
   le nombre. Certaines d'entre elles impliquent l'application de
   règles automatiques pour conserver la structure de la liste
   intacte. Si certaines de ces actions vous gênent, configurez
   =org-list-automatic-rules= pour les désactiver individuellement. 

   + =TAB= (=org-cycle=) :: Les éléments peuvent être pliés comme les
        rubriques de niveaux. Normalement cela fonctionne uniquement
        si le point est sur un élément de liste brute. Pour plus de détails,
        voir la variable =org-cycle-include-plain-lists=. Si cette
        variable est configurée à =integrate=, les éléments de liste
        brute sont traités comme des rubriques de bas niveau. Le
        niveau d'un élément est alors donné par l'indentation de la
        puce/du nombre. Les éléments sont toujours subordonnés aux
        réelles rubriques, toutefois; les hiérarchies restent
        totalement séparées. Dans un nouvel élément sans encore de
        texte, le premier =TAB= rélègue l'élément à devenir un enfant
        du précédent. Les =TAB=s suivants déplacent l'élément aux
        niveaux significatifs dans la liste le remettant
        éventuellement à sa place initiale.
   + =M-RET= (=org-insert-heading=) :: Insère un nouvel élément dans
        le niveau courant. Avec un argument préfixé, force un nouvelle
        rubrique (voir Section 2.5 [Structure Editing]). Si cette
        commande est utilisée au milieu d'un élément, cet élément est
        /éclaté/ en deux, et la seconde partie devient le nouvel
        élément[fn:13]. Si cette commande est exécutée /avant le corps de l'élément/, le nouvel élément est créé /avant/ l'actuel. 
   + =M-S-RET= :: Insère un nouvel élément avec une case à cocher
                  (voir Section 5.6 [Checkboxes]).
   + =S-UP= / =S-DOWN= :: Saute à l'élément précédent/suivant dans la
        liste en cours, mais seulement si =org-support-shift-select=
        est désactivé[fn:14]. Sinon, vous pouvez encore utiliser les
        commande de saut de paragraphe comme =C-UP= et =C-DOWN= pour
        des effets assez similaires. 
   + =M-UP= / =M-DOWN= :: Déplace l'élément incluant les sous-éléments
        haut/bas[fn:15], i.e, échanger avec l'élément
        précédent/suivant de même indentation. Si la liste est
        ordonnée, renumérote automatiquement. 
   + =M-LEFT= / =M-RIGHT= :: Diminue/augmente l'indentation d'un
        élément, laissant tranquille les enfants. 
   + =M-S=LEFT= / =M-S-RIGHT= :: Diminue/augmente l'indentation de
        l'élément, incluant les sous-éléments. Initialement, l'élément
        arbre est sélectionné sur la base de l'indentation
        courante. Lorsque ces commandes sont exécutées plusieurs fois
        consécutivement, la région initialement sélectionnée est
        utilisée, même si la nouvelle indentation impliquerait une
        hiérarchie différente. Pour utiliser la nouvelle hiérarchie,
        casser la chaîne de commande en déplaçant le point.
	
	Comme un cas spécial, utiliser cette commande sur le tout
        premier élément d'une liste déplace la liste entière. Ce
        comportement peut être désactivé en configurant
        =org-list-automatic-rules=. L'indentation globale d'une liste
        n'a pas d'influence sur le texte /après/ la liste. 
   + =C-c C-c= :: S'il y a une case à cocher (voir Section 5.6
                  [Checkboxes]) dans la ligne de l'élément, bascule
                  l'état de la cse à cocher. Dans tous les cas,
                  vérifie la cohérence des puces et de l'indentation
                  dans la liste entière. 
   + =C-c -= :: Parcourt (cycle) le niveau entier de la liste via les
                différents éléments/puces ('=-=', '=+=', '=*=',
                '=1.=', '=1)=') ou un sous-ensemble d'entre eux, selon
                =org-plain-list-ordered-item-terminator=, le type de
                liste, et son indentation. Avec un argument numérique
                préfixé N, sélectionne la Nème puce de cette
                liste. S'il y a une région active lors de cet appel,
                le texte sélectionné est modifié en un élément. Avec
                un argument préfixé, toutes les lignes sont converties
                en éléments de liste. Si la première ligne est déjà un
                élément de liste, tous les marqueurs sont effacés de
                la liste. Finalement, même sans une région active, une
                ligne normale est convertie en un élément de liste. 
   + =C-c *= :: Transforme un élément de liste brute en une
                rubrique---de sorte que ça devient une sous-rubrique à
                son emplacement. Voir Section 2.5 [Structure Editing],
                pour une explication plus détaillée.
   + =C-c C-*= :: Transforme la liste brute entière en un sous-arbre
                  de la rubrique en cours. Les cases à cocher (voir
                  Section 5.6 [Checkboxes]) deviennent des mots-clés
                  TODO, et DONE respectivement, lorsque non cochées,
                  et respectivement lorsque cochées. 
   + =S-LEFT= / =S-RIGHT= :: Cette commande parcourt les styles de
        puce lorsque le point est sur la puce ou n'importe où dans
        une ligne d'un élément, les détails dépendent de
        =org-support-shift-select=. 
   + =C-c ^= :: Tri la liste brute. Attend la méthode de tri :
                numériquement, alphabétiquement, par date, ou par une
                fonction personnalisée.

