org-manual.html

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Listes</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Dans une entrée de l'arborescence, des listes formatées à la main
peuvent fournir une structure supplémentaire. Elles fournissent
également un moyen de créer des listes de cases à cocher (voir
Section 5.6 [Checkboxes]). Org soutient l'édition de telles listes,
et chaque exportateur (voir Chapitre 12 [Exporting]) peut les
analyser et les formater.
</p>

<p>
Org connaît les listes ordonnées, les listes non-ordonnées, et les
listes descriptives. 
</p>
<ul class="org-ul">
<li>Les éléments des listes non-ordonnées commencent par '<code>-</code>', '<code>+</code>', ou
'<code>*</code>'<sup><a id="fnr.9" name="fnr.9" class="footref" href="#fn.9">9</a></sup> en tant que puces.
</li>
<li>Les éléments des listes ordonnées commencent par un nombre suivi
par soit un point ou une parenthèse droite<sup><a id="fnr.10" name="fnr.10" class="footref" href="#fn.10">10</a></sup>, tels que
'<code>1.</code>', ou '<code>1)</code>'<sup><a id="fnr.11" name="fnr.11" class="footref" href="#fn.11">11</a></sup>. Si vous voulez
qu'une liste commence avec une valeur différente&#x2014;par exemple,
20&#x2014;commencez le texte avec '<code>[@20]</code>'<sup><a id="fnr.12" name="fnr.12" class="footref" href="#fn.12">12</a></sup>. Ces constructions
peuvent être utilisées dans n'importe quel élément de la liste
afin de renforcer une numérotation particulière. 
</li>
<li>Les éléments des listes descriptives des éléments de listes
non-ordonnées, et contiennent le séparateur '<code>::</code>' pour le
<i>terme</i> de description de la description.
</li>
</ul>


<p>
Les éléments appartenant à la même liste doivent avoir la même
indentation sur la première ligne. En particulier, si une liste
ordonnée atteint le nombre '<code>10.</code>', alors les nombres à 2 chiffres
doivent être écrits alignés à gauche avec les autres nombres de la
liste. Un élément finit avant la prohcaine ligne qui est moins ou
également indentée que sa puce/son nombre.
</p>

<p>
Une liste finit chaque fois que tous les éléments sont finis, ce
qui signifie avant toute ligne moins ou également indentée que les
éléments top niveau. Elle finit aussi avant deux lignes
blanches. Dans ce cas, tous les éléments sont fermés. Voici un
exemple :
</p>
<div class="org-src-container">

<pre class="src src-org">* Le seigneur des anneaux
Mes scènes favorites sont (dans cet ordre)
1. L'attaque de Rohirrim
2. Le combat d'Eowyn avec le roi sorcier
   + c'était déjà ma scène favorite dans le livre
   + J'aime vraiment Miranda Otto. 
3. Peter Jackson tiré par Legolas
   - dans le DVD seulement
   Il fait une tête vraiment amusante quand ça arrive.
Mais au final, aucune scène individuelle ne compte mais le film dans
son ensemble. 
Acteurs majeurs dans ce film :
- Elijah Wood :: Il joue Frodon
- Sean Astin :: Il joue Sam, l'ami de Frodon. Je me rappelle encore
		très bien de lui dans son rôle de Mikey Walsh dans
		/les Goonies/.
</pre>
</div>
<p>
Org prend en charge ces listes en ajustant les commandes de
remplissage et d'habillage pour les traiter correctement et en les
exportant correctement (voir Chapitre 12 [Exporting]). Puisque
l'indentation est ce qui gouverne la structure de ces listes,
beaucoup de constructions structurelles comme les blocs
'<code>#+BEGIN_</code>' peuvent être indentés pour signaler leur appartenance
à un élément particulier.
</p>

<p>
Si vous trouvez qu'utiliser une puce différente pour une
sous-liste&#x2014;que celle utilisée pour le niveau de la liste
courante&#x2014;améliore la lisibilité, personnalisez la variable
<code>org-list-demote-modify-bullet</code>.  Pour obtenir une différence plus
importante d'indentation entre éléments et sous-éléments,
personnaliser <code>org-list-indent-offset</code>.
</p>

<p>
Les commandes suivantes agissent sur les éléments lorsque le point
est dans la première ligne d'un élément&#x2014;la ligne avec la puce ou
le nombre. Certaines d'entre elles impliquent l'application de
règles automatiques pour conserver la structure de la liste
intacte. Si certaines de ces actions vous gênent, configurez
<code>org-list-automatic-rules</code> pour les désactiver individuellement. 
</p>

<dl class="org-dl">
<dt> <code>TAB</code> (<code>org-cycle</code>) </dt><dd>Les éléments peuvent être pliés comme les
rubriques de niveaux. Normalement cela fonctionne uniquement
si le point est sur un élément de liste brute. Pour plus de détails,
voir la variable <code>org-cycle-include-plain-lists</code>. Si cette
variable est configurée à <code>integrate</code>, les éléments de liste
brute sont traités comme des rubriques de bas niveau. Le
niveau d'un élément est alors donné par l'indentation de la
puce/du nombre. Les éléments sont toujours subordonnés aux
réelles rubriques, toutefois; les hiérarchies restent
totalement séparées. Dans un nouvel élément sans encore de
texte, le premier <code>TAB</code> rélègue l'élément à devenir un enfant
du précédent. Les =TAB=s suivants déplacent l'élément aux
niveaux significatifs dans la liste le remettant
éventuellement à sa place initiale.
</dd>
<dt> <code>M-RET</code> (<code>org-insert-heading</code>) </dt><dd>Insère un nouvel élément dans
le niveau courant. Avec un argument préfixé, force un nouvelle
rubrique (voir Section 2.5 [Structure Editing]). Si cette
commande est utilisée au milieu d'un élément, cet élément est
<i>éclaté</i> en deux, et la seconde partie devient le nouvel
élément<sup><a id="fnr.13" name="fnr.13" class="footref" href="#fn.13">13</a></sup>. Si cette commande est exécutée <i>avant le corps de l'élément</i>, le nouvel élément est créé <i>avant</i> l'actuel. 
</dd>
<dt> <code>M-S-RET</code> </dt><dd>Insère un nouvel élément avec une case à cocher
(voir Section 5.6 [Checkboxes]).
</dd>
<dt> <code>S-UP</code> / <code>S-DOWN</code> </dt><dd>Saute à l'élément précédent/suivant dans la
liste en cours, mais seulement si <code>org-support-shift-select</code>
est désactivé<sup><a id="fnr.14" name="fnr.14" class="footref" href="#fn.14">14</a></sup>. Sinon, vous pouvez encore utiliser les
commande de saut de paragraphe comme <code>C-UP</code> et <code>C-DOWN</code> pour
des effets assez similaires. 
</dd>
<dt> <code>M-UP</code> / <code>M-DOWN</code> </dt><dd>Déplace l'élément incluant les sous-éléments
haut/bas<sup><a id="fnr.15" name="fnr.15" class="footref" href="#fn.15">15</a></sup>, i.e, échanger avec l'élément
précédent/suivant de même indentation. Si la liste est
ordonnée, renumérote automatiquement. 
</dd>
<dt> <code>M-LEFT</code> / <code>M-RIGHT</code> </dt><dd>Diminue/augmente l'indentation d'un
élément, laissant tranquille les enfants. 
</dd>
<dt> <code>M-S=LEFT</code> / <code>M-S-RIGHT</code> </dt><dd>Diminue/augmente l'indentation de
l'élément, incluant les sous-éléments. Initialement, l'élément
arbre est sélectionné sur la base de l'indentation
courante. Lorsque ces commandes sont exécutées plusieurs fois
consécutivement, la région initialement sélectionnée est
utilisée, même si la nouvelle indentation impliquerait une
hiérarchie différente. Pour utiliser la nouvelle hiérarchie,
casser la chaîne de commande en déplaçant le point.

<p>
Comme un cas spécial, utiliser cette commande sur le tout
premier élément d'une liste déplace la liste entière. Ce
comportement peut être désactivé en configurant
<code>org-list-automatic-rules</code>. L'indentation globale d'une liste
n'a pas d'influence sur le texte <i>après</i> la liste. 
</p>
</dd>
<dt> <code>C-c C-c</code> </dt><dd>S'il y a une case à cocher (voir Section 5.6
[Checkboxes]) dans la ligne de l'élément, bascule
l'état de la cse à cocher. Dans tous les cas,
vérifie la cohérence des puces et de l'indentation
dans la liste entière. 
</dd>
<dt> <code>C-c -</code> </dt><dd>Parcourt (cycle) le niveau entier de la liste via les
différents éléments/puces ('<code>-</code>', '<code>+</code>', '<code>*</code>',
'<code>1.</code>', '<code>1)</code>') ou un sous-ensemble d'entre eux, selon
<code>org-plain-list-ordered-item-terminator</code>, le type de
liste, et son indentation. Avec un argument numérique
préfixé N, sélectionne la Nème puce de cette
liste. S'il y a une région active lors de cet appel,
le texte sélectionné est modifié en un élément. Avec
un argument préfixé, toutes les lignes sont converties
en éléments de liste. Si la première ligne est déjà un
élément de liste, tous les marqueurs sont effacés de
la liste. Finalement, même sans une région active, une
ligne normale est convertie en un élément de liste. 
</dd>
<dt> <code>C-c *</code> </dt><dd>Transforme un élément de liste brute en une
rubrique&#x2014;de sorte que ça devient une sous-rubrique à
son emplacement. Voir Section 2.5 [Structure Editing],
pour une explication plus détaillée.
</dd>
<dt> <code>C-c C-*</code> </dt><dd>Transforme la liste brute entière en un sous-arbre
de la rubrique en cours. Les cases à cocher (voir
Section 5.6 [Checkboxes]) deviennent des mots-clés
TODO, et DONE respectivement, lorsque non cochées,
et respectivement lorsque cochées. 
</dd>
<dt> <code>S-LEFT</code> / <code>S-RIGHT</code> </dt><dd>Cette commande parcourt les styles de
puce lorsque le point est sur la puce ou n'importe où dans
une ligne d'un élément, les détails dépendent de
<code>org-support-shift-select</code>. 
</dd>
<dt> <code>C-c ^</code> </dt><dd>Tri la liste brute. Attend la méthode de tri :
numériquement, alphabétiquement, par date, ou par une
fonction personnalisée.
</dd>
</dl>
</div>
</div>
