org-manual.org
** Tiroirs
   Parfois vous voulez garder l'information associée à une entrée,
   mais usuellement vous ne voulez pas la voir. Pour ça, le mode Org a
   les /tiroirs/. Ils peuvent contenir n'importe quoi sauf une
   rubrique ou un autre tiroir. Les tiroirs ressemblent à ça :
   #+BEGIN_SRC org
     ,** Ceci est une rubrique
     Toujours à l'extérieur du tiroir
     :DRAWERNAME:
     Ceci est l'intérieur du tiroir.
     :END:
     Après le tiroir.
   #+END_SRC
   Vous pouvez insérer interactivement un tiroir au point en appelant
   =org-insert-drawer=, qui lié à =C-c C-x d=. Avec une région active,
   cette commande met la région à l'intérieur du tiroir. Avec un
   argument préfixé, cette commande appelle
   =org-insert-property-drawer=, qui crée un tiroir '=PROPERTIES='
   juste en dessous de la ligne courante.L Le mode Org utilise ce
   tiroir spécial pour trier les propriétés (voir Chapitre 7
   [Properties and Columns]). Vous ne pouvez pas l'utiliser pour autre
   chose. 

   La complétion sur les mots-clés du tiroir est aussi possible en
   utilisant =M-TAB=[fn:16]. 

   Le cycle de visibilité (voir Section 2.3 [Visibility Cycling]) sur
   la rubrique cache et montre l'entrée, mais garde le tiroir éclaté
   sur une seule ligne. Afin de regarder à l'intérieur du tiroir, vous
   devez déplacer le point sur la ligne du tiroir et y presser =TAB=.

   Vous pouvez également organiser des notes de changement d'état
   (voir Section 5.3.2 [Tracking TODO state changes]) et des horaires
   (voir Section 8.4 [Clocking Work Time]) pour être stocké dans un
   tiroir '=LOGBOOK='. Si vous voulez stocker une note brève là, de
   façon similaire au changement d'état, utilisez
   + =C-c C-z= :: Ajoutez une note d'horodatage au tiroir
                  '=LOGBOOK='. 

** Blocs
   Le mode Org utilise des blocs '=#+BEGIN=' ... '=#+END=' pour des
   buts variés de l'inclusion d'exemples de codes sources (voir
   Section 11.6 [Literal Examples]) à la capture de l'heure
   d'enregistrement d'information (voir Section 8.4 [Clocking Work
   Time]). Ces blocs peuvent être pliés et dépliés en pressant =TAB=
   dans la ligne '=#+BEGIN='. Vous pouvez aussi obtenir tous les blocs
   pliés à startup en configurant la variable =org-hide-block-startup=
   ou par fichier en utilisant :
   #+BEGIN_SRC org
     ,#+STARTUP: hideblocks
     ,#+STARTUP: nohideblocks
   #+END_SRC
** Création de notes de pied de page   
   Le mode Org supporte la création de notes de pied de page.

   Une note de pied de page est commencée par un marqueur de note de
   pied de page dans entre crochets en colonne 0, aucune indentation n'est
   acceptée. Elle finit à la définition de la prochaine définition
   note de pied de page, rubrique, ou après deux lignes blanches
   consécutives. La référence de la note de pied de page est
   simplement le marqueur entre crochets, à l'intérieur du texte. Les
   marqueurs commencent toujours avec '=fn:='. Par exemple :
   #+BEGIN_SRC org
     La page d'accueil Org[fn:1] a l'air beaucoup mieux maintenant
     qu'avant.
     ...
     [fn:1] Le lien est : https://orgmode.org
   #+END_SRC
   Le mode Org étend la syntaxe basée sur les numéros aux notes de
   pied de page /nommées/ et aux définitions optionnelles en
   ligne. Voici des références valides :
   + '=[fn:NAME]=' :: Une référence de note de pied de page nommée, où
                      NAME est un mot étiquette unique, ou, par
                      simplicité de la création automatique, un
                      nombre.
   + '=[fn:: Ceci est une définition en ligne de cette note]=' :: Une
        note anonyme à la \LaTeX où la définition est donnée
        directement à la référence du point.
   + '=[fn:NAME: une définition]=' :: Une définition en ligne d'une
        note de pied de page, qui spécifie aussi un nom de la
        note. Puisque Org autorise les références multiples à la même
        note, vous pouvez alors utiliser '=[fn:NAME]=' pour créer des
        références supplémentaires. 

    
   Les étiquettes de note de pied de page peuvent être créées
   automatiquement, ou vous pouvez créer des noms vous-même. C'est
   géré par la variable =org-footnote-auto-label= et ses mots-clés
   '=STARTUPT=' correspondants. Voir la documentation pour plus de
   détails. 

   Les commandes suivantes manipulent les notes de pied de page :
   + =C-c C-x f= :: La commande d'action de note.
		    
		    Lorsque le point est sur une référence de note,
                    saute jusqu'à la définition. Lorsque c'est à la
                    définition, saute jusqu'à
                    la---première---référence.

		    Autrement, crée une nouvelle note. Selon la
                    variable =org-footnote-define-inline=[fn:17], la
                    définition est placée juste dans le texte comme
                    partie de la référence, ou séparément dans
                    l'emplacement réservé par la variable
                    =org-footnote-section=. 

		    Lorsque cette commande est appelée avec un
                    argument préfixé, un menu supplémentaire est
                    offert :
		    + =s= :: Tri les définitions de note par suite de
		             référence. 
	            + =r= :: Renumérote les notes simples '=fn:N='
                    + =S= :: Raccourci pour les actions =r= en
                             premier, puis =s=
                    + =n= :: Renomme toutes les notes dans une suite
                             '=fn:1=' ... '=fn:n='
                    + =d= :: Efface la note au point, incluant la
                             définition et les références.

		    Selon la variable
                    =org-footnote-auto-adjust=[fn:18], la renumérotation et
                    le tri des notes peut être automique après chaque
                    insertion ou suppression.
   + =C-c C-c= :: Si le point est référence de note, saute à la
                  définition. S'il est à la définition, retourne à la
                  référence. Lorsqu'appelée à l'emplacement d'une note
                  avec un argument préfixé, offre le même menu que
                  =C-c C-x f=.
   + =C-c C-o= ou =mouse-1/2= :: Des étiquettes de notes sont aussi
        liées aux définitions ou références correspondantes, et vous
        pouvez utiliser les commandes usuelles pour suivre ces liens. 

* Tableaux
  Org vient avec un éditeur de tableau rapide et intuitif. Les calculs
  de type tableur sont possibles en utilisant le paquet Emacs Calc
  (voir calc). 
