org-manual.html

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Tiroirs</h3>
<div class="outline-text-3" id="text-2-8">
<p>
Parfois vous voulez garder l'information associée à une entrée,
mais usuellement vous ne voulez pas la voir. Pour ça, le mode Org a
les <i>tiroirs</i>. Ils peuvent contenir n'importe quoi sauf une
rubrique ou un autre tiroir. Les tiroirs ressemblent à ça :
</p>
<div class="org-src-container">

<pre class="src src-org">** Ceci est une rubrique
Toujours à l'extérieur du tiroir
:DRAWERNAME:
Ceci est l'intérieur du tiroir.
:END:
Après le tiroir.
</pre>
</div>
<p>
Vous pouvez insérer interactivement un tiroir au point en appelant
<code>org-insert-drawer</code>, qui lié à <code>C-c C-x d</code>. Avec une région active,
cette commande met la région à l'intérieur du tiroir. Avec un
argument préfixé, cette commande appelle
<code>org-insert-property-drawer</code>, qui crée un tiroir '<code>PROPERTIES</code>'
juste en dessous de la ligne courante.L Le mode Org utilise ce
tiroir spécial pour trier les propriétés (voir Chapitre 7
[Properties and Columns]). Vous ne pouvez pas l'utiliser pour autre
chose. 
</p>

<p>
La complétion sur les mots-clés du tiroir est aussi possible en
utilisant <code>M-TAB</code><sup><a id="fnr.16" name="fnr.16" class="footref" href="#fn.16">16</a></sup>. 
</p>

<p>
Le cycle de visibilité (voir Section 2.3 [Visibility Cycling]) sur
la rubrique cache et montre l'entrée, mais garde le tiroir éclaté
sur une seule ligne. Afin de regarder à l'intérieur du tiroir, vous
devez déplacer le point sur la ligne du tiroir et y presser <code>TAB</code>.
</p>

<p>
Vous pouvez également organiser des notes de changement d'état
(voir Section 5.3.2 [Tracking TODO state changes]) et des horaires
(voir Section 8.4 [Clocking Work Time]) pour être stocké dans un
tiroir '<code>LOGBOOK</code>'. Si vous voulez stocker une note brève là, de
façon similaire au changement d'état, utilisez
</p>
<dl class="org-dl">
<dt> <code>C-c C-z</code> </dt><dd>Ajoutez une note d'horodatage au tiroir
'<code>LOGBOOK</code>'. 
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Blocs</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Le mode Org utilise des blocs '<code>#+BEGIN</code>' &#x2026; '<code>#+END</code>' pour des
buts variés de l'inclusion d'exemples de codes sources (voir
Section 11.6 [Literal Examples]) à la capture de l'heure
d'enregistrement d'information (voir Section 8.4 [Clocking Work
Time]). Ces blocs peuvent être pliés et dépliés en pressant <code>TAB</code>
dans la ligne '<code>#+BEGIN</code>'. Vous pouvez aussi obtenir tous les blocs
pliés à startup en configurant la variable <code>org-hide-block-startup</code>
ou par fichier en utilisant :
</p>
<div class="org-src-container">

<pre class="src src-org">#+STARTUP: hideblocks
#+STARTUP: nohideblocks
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Création de notes de pied de page</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Le mode Org supporte la création de notes de pied de page.
</p>

<p>
Une note de pied de page est commencée par un marqueur de note de
pied de page dans entre crochets en colonne 0, aucune indentation n'est
acceptée. Elle finit à la définition de la prochaine définition
note de pied de page, rubrique, ou après deux lignes blanches
consécutives. La référence de la note de pied de page est
simplement le marqueur entre crochets, à l'intérieur du texte. Les
marqueurs commencent toujours avec '<code>fn:</code>'. Par exemple :
</p>
<div class="org-src-container">

<pre class="src src-org">La page d'accueil Org[fn:1] a l'air beaucoup mieux maintenant
qu'avant.
...
[fn:1] Le lien est : https://orgmode.org
</pre>
</div>
<p>
Le mode Org étend la syntaxe basée sur les numéros aux notes de
pied de page <i>nommées</i> et aux définitions optionnelles en
ligne. Voici des références valides :
</p>
<dl class="org-dl">
<dt> '<code>[fn:NAME]</code>' </dt><dd>Une référence de note de pied de page nommée, où
NAME est un mot étiquette unique, ou, par
simplicité de la création automatique, un
nombre.
</dd>
<dt> '<code>[fn:: Ceci est une définition en ligne de cette note]</code>' </dt><dd>Une
note anonyme à la \LaTeX où la définition est donnée
directement à la référence du point.
</dd>
<dt> '<code>[fn:NAME: une définition]</code>' </dt><dd>Une définition en ligne d'une
note de pied de page, qui spécifie aussi un nom de la
note. Puisque Org autorise les références multiples à la même
note, vous pouvez alors utiliser '<code>[fn:NAME]</code>' pour créer des
références supplémentaires. 
</dd>
</dl>


<p>
Les étiquettes de note de pied de page peuvent être créées
automatiquement, ou vous pouvez créer des noms vous-même. C'est
géré par la variable <code>org-footnote-auto-label</code> et ses mots-clés
'<code>STARTUPT</code>' correspondants. Voir la documentation pour plus de
détails. 
</p>

<p>
Les commandes suivantes manipulent les notes de pied de page :
</p>
<dl class="org-dl">
<dt> <code>C-c C-x f</code> </dt><dd>La commande d'action de note.

<p>
Lorsque le point est sur une référence de note,
saute jusqu'à la définition. Lorsque c'est à la
définition, saute jusqu'à
la&#x2014;première&#x2014;référence.
</p>

<p>
Autrement, crée une nouvelle note. Selon la
variable <code>org-footnote-define-inline</code><sup><a id="fnr.17" name="fnr.17" class="footref" href="#fn.17">17</a></sup>, la
définition est placée juste dans le texte comme
partie de la référence, ou séparément dans
l'emplacement réservé par la variable
<code>org-footnote-section</code>. 
</p>

<p>
Lorsque cette commande est appelée avec un
argument préfixé, un menu supplémentaire est
offert :
</p>
<dl class="org-dl">
<dt> <code>s</code> </dt><dd>Tri les définitions de note par suite de
référence. 
</dd>
<dt> <code>r</code> </dt><dd>Renumérote les notes simples '<code>fn:N</code>'
</dd>
<dt> <code>S</code> </dt><dd>Raccourci pour les actions <code>r</code> en
premier, puis <code>s</code>
</dd>
<dt> <code>n</code> </dt><dd>Renomme toutes les notes dans une suite
'<code>fn:1</code>' &#x2026; '<code>fn:n</code>'
</dd>
<dt> <code>d</code> </dt><dd>Efface la note au point, incluant la
définition et les références.
</dd>
</dl>

<p>
Selon la variable
<code>org-footnote-auto-adjust</code><sup><a id="fnr.18" name="fnr.18" class="footref" href="#fn.18">18</a></sup>, la renumérotation et
le tri des notes peut être automique après chaque
insertion ou suppression.
</p>
</dd>
<dt> <code>C-c C-c</code> </dt><dd>Si le point est référence de note, saute à la
définition. S'il est à la définition, retourne à la
référence. Lorsqu'appelée à l'emplacement d'une note
avec un argument préfixé, offre le même menu que
<code>C-c C-x f</code>.
</dd>
<dt> <code>C-c C-o</code> ou <code>mouse-1/2</code> </dt><dd>Des étiquettes de notes sont aussi
liées aux définitions ou références correspondantes, et vous
pouvez utiliser les commandes usuelles pour suivre ces liens. 
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tableaux</h2>
<div class="outline-text-2" id="text-3">
<p>
Org vient avec un éditeur de tableau rapide et intuitif. Les calculs
de type tableur sont possibles en utilisant le paquet Emacs Calc
(voir calc). 
</p>
</div>
