org-manual.html
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Editeur de tableau intégré</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Org rend cela facile de formater des tableaux en ASCII brut. Toute
ligne avec '<code>|</code>' comme le premier caractère non-espace est
considéré comme partie du tableau.L '<code>|</code>' est aussi le séparateur
de colonne<sup><a id="fnr.19" name="fnr.19" class="footref" href="#fn.19">19</a></sup>. De plus, une ligne commençant par '<code>|-</code>' est une
ligne horizontale. Cela sépare explicitement les rangées. Les
rangées avant la ligne horizontale sont des en-tête de ligne. Un
tableau pourrait ressembler à ça :
</p>
<div class="org-src-container">

<pre class="src src-org">| Nom   | Téléphone | Âge |
|-------+-----------+-----|
| Peter |      1234 |  17 |
| Anna  |      4321 | 25  |
</pre>
</div>
<p>
Un tableau est ré-aligné automatiquement chaque fois que vous
pressez <code>TAB</code>, <code>RET</code> ou <code>C-c C-c</code> dans le tableau. <code>TAB</code> déplace
aussi vers le prochain champ---<code>RET</code> vers la prochaine rangée&#x2014;et
crée de nouvelles rangées de tableau à la fin du tableau ou avant
les lignes horizontales. L'indentation du tableau est définie par
la première ligne. Les lignes horizontales sont automatiquement
étendue sur chaque ré-alignement pour couvrir toute la largeur du
tableau. Donc, pour créer le tableau ci-dessous vous taperiez :
</p>
<div class="org-src-container">

<pre class="src src-org">| Nom | Téléphone | Âge |
|-
</pre>
</div>
<p>
et ensuite presserez <code>TAB</code> pour aligner le tableau et le début du
remplissage des champs. Même encore plus vite
'<code>|Nom|Téléphone|Âge</code>' suivi par <code>C-c RET</code>.
</p>

<p>
Lorsque vous tapez du texte dans un champ, Org traite <code>DEL</code>,
<code>Backspace</code>, et toutes les touches de caractères d'une façon
spéciale, de sorte que ça insère et supprime évitant de décaler les
autres champs. Aussi, lorsque vous tapez <i>immédiatement</i> après que le
point ait été déplacé dans un nouveau champ avec <code>TAB</code>, <code>S-TAB</code> ou
<code>RET</code>, le champ est automatiquement rendu vierge. Si ce
comportement est trop imprédictible pour vous, configurez l'option
<code>org-table-auto-blank-field</code>. 
</p>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Création et conversion</h4>
<div class="outline-text-4" id="text-3-1-1">
<dl class="org-dl">
<dt> <code>C-c |</code> (<code>org-table-create-or-convert-from-region</code>) </dt><dd>Convertit
la région active en tableau. Si chaque ligne contient au
moins un caractère <code>TAB</code>, la fonction suppose que le matériel
est séparé par des tab. Si chaque ligne contient une virgule,
Comma-Seperated-Value (CSV) est supposé. Sinon, les lignes
sont éclatées en espaces blancs dans les champs. Vous pouvez
utiliser un argument préfixé pour forcer un séparateur
spécifique : <code>C-u</code> force CSV, <code>C-u C-u</code> force <code>TAB</code>, <code>C-u C-u
         C-u</code> invite à saisir une expression régulière pour
correspondre au séparateur, et un argument numérique N
indique que le séparateur sera au moins N espaces
consécutifs, ou alternativement une <code>TAB</code>. 

<p>
S'il n'y a pas de région active, cette commande crée un
tableau Org vide. Mais il est plus facile de commencer à
taper, comme <code>|Name|Phone|Age RET|- TAB</code>.
</p>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Réalignement et déplacement de champ</h4>
<div class="outline-text-4" id="text-3-1-2">
<dl class="org-dl">
<dt> <code>C-c C-c</code> (<code>org-table-align</code>) </dt><dd>Ré-aligne le tableau sans
déplacer le point.
</dd>
<dt> <code>TAB</code> (<code>org-table-next-field</code>) </dt><dd>Ré-aligne le tableau, bouge
vers le champ suivant. Crée une nouvelle rangée si
nécessaire.
</dd>
<dt> <code>C-c SPC</code> (<code>org-table-blank-field</code>) </dt><dd>Rend le champ vide au
point.  
</dd>
<dt> <code>S-TAB</code> (<code>org-table-previous-field</code>) </dt><dd>Ré-aligne, bouge au
champ précédent. 
</dd>
<dt> <code>RET</code> (<code>org-table-next-row</code>) </dt><dd>Ré-aligne le tableau et descend
d'une rangée. Crée une nouvelle rangée si nécessaire. Au
début ou à la fin d'une ligne, <code>RET</code> insère encore une ligne,
donc ça peut être utilisé pour diviser un tableau.
</dd>
<dt> <code>M-a</code> (<code>org-table-beginning-of-field</code>) </dt><dd>Bouge au début du
champ courant, ou vers le champ précédent. 
</dd>
<dt> <code>M-e</code> (<code>org-table-end-of-field</code>) </dt><dd>Bouge à la fin du champ
courant, ou vers le champ suivant.
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Edition de ligne et colonne</h4>
<div class="outline-text-4" id="text-3-1-3">
<dl class="org-dl">
<dt> <code>M-LEFT</code> (<code>org-table-move-column-left</code>) </dt><dd>Déplace la colonne
courante vers la gauche.
</dd>
<dt> <code>M-RIGHT</code> (<code>org-table-move-column-right</code>) </dt><dd>Déplace la colonne
courante vers la droite.
</dd>
<dt> <code>M-S-LEFT</code> (<code>org-table-delete-column</code>) </dt><dd>Détruit la colonne
courante. 
</dd>
<dt> <code>M-S-RIGHT</code> (<code>org-table-insert-column</code>) </dt><dd>Insère une nouvelle
colonne à la gauche de la position du point.
</dd>
<dt> <code>M-UP</code> (<code>org-table-move-row-up</code>) </dt><dd>Déplace la ligne courante
vers le haut.
</dd>
<dt> <code>M-DOWN</code> (<code>org-table-move-row-down</code>) </dt><dd>Déplace la ligne
courante vers le bas.
</dd>
<dt> <code>M-S-UP</code> (<code>org-table-kill-row</code>) </dt><dd>Détruit la ligne courante ou
la ligne horizontale (le filet)
</dd>
<dt> <code>M-S-DOWN</code> (<code>org-table-insert-row</code>) </dt><dd>Insère une nouvelle ligne
au-dessus de l'actuelle. Avec un argument préfixé, la ligne
est créée au dessous de l'actuelle. 
</dd>
<dt> <code>C-c -</code> (<code>org-table-insert-hline</code>) </dt><dd>Insère une ligne
horizontale sous l'actuelle. Avec un argument préfixé, la
ligne est créée au-dessus de l'actuelle. 
</dd>
<dt> <code>C-c RET</code> (<code>org-table-hline-and-move</code>) </dt><dd>Insère une ligne
horizontale sous l'actuelle, et déplace le point dans la
ligne sous le filet.
</dd>
<dt> <code>C-c ^</code> (<code>org-table-sort-lines</code>) </dt><dd>Tri les lignes du tableau
dans la région. La position du point indique la colonne à
utiliser pour le tri, et l'étendue de lignes est l'étendue
entre le séparteur de ligne le plus proche, ou le tableau
entier. S'il n'y a pas de région active, la marque spécifie
la première ligne et la colonne de tri, alors que le point
devrait être dans la dernière ligne à être inclus dans le
tri. La commande invite à saisir le type de tri,
alphabétiquement, numériquement, ou par date. Vous pouvez
trier dans l'ordre croissant ou décroissant. Vous pouvez
aussi fournir votre propre clé d'extraction et fonction de
comparaison. Lorsqu'appelée avec un argument préfixé, le tri
alphabétique est sensible à la casse.
</dd>
</dl>
</div>
</div>
