org-manual.html

<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> Régions</h4>
<div class="outline-text-4" id="text-3-1-4">
<dl class="org-dl">
<dt> <code>C-c C-x M-w</code> (<code>org-table-copy-region</code>) </dt><dd>Copie une région
rectangulaire depuis un tableau vers un presse-papier
spécial. Le point et la marque déterminent les bords des
champs du rectangle. S'il n'y a pas de région active, copie
juste le champ courant. Le processus ignore les séparateurs
de lignes horizontales.
</dd>
<dt> <code>C-c C-x C-w</code> (<code>org-table-cut-region</code>) </dt><dd>Copie une région
rectangulaire depuis un tableau vers un presse-papier
spécial, et efface tous les champs dans le rectangle. Donc
c'est l'opération "couper".
</dd>
<dt> <code>C-c C-x C-y</code> (<code>org-table-paste-rectangle</code>) </dt><dd>Colle une région
rectangulaire dans un tableau. Le coin supérieur gauche finit
dans le champ courant. Tous les champs impliqués sont
écrasés. Si le rectangle ne rentre pas dans le présent
tableau, le tableau est élargi autant que nécessaire. Le
processus ignore les séparateurs de lignes horizontales.
</dd>
<dt> <code>M-RET</code> (<code>org-table-wrap-region</code>) </dt><dd>Divise le champ courant à
la position du point et déplace le reste vers la ligne du
dessous. S'il n'y a pas de région active, et le point et la
marque dans la même colonne, le texte dans la colonne est
enroulé dans la largeur minimale pour le nombre donné de
lignes. Un argument numérique préfixé peut être utilisé pour
changer le nombre de lignes désirées. S'il n'y a pas de
région active, mais que vous spécifiez un argument préfixé,
le champ courant est rendu vierge, et le contenu et ajouté au
champ au dessus.  
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> Calculs</h4>
<div class="outline-text-4" id="text-3-1-5">
<dl class="org-dl">
<dt> <code>C-c +</code> (<code>org-table-sum</code>) </dt><dd>Somme les nombres dans la colonne
courante, ou dans le rectangle défini par la région
active. Le résultat est montré dans la zone d'écho et peut
être inséré avec <code>C-y</code>.
</dd>
<dt> <code>S-RET</code> (<code>org-table-copy-down</code>) </dt><dd>Lorsque le champ actuel est
vide, copiez le premier champ non vide ci-dessus. Lorsqu'il
n'est pas vide, copiez le champ actuel dans la rangée
suivante et déplacez le point avec lui. Selon la variable
<code>org-table-copy-increment</code>, des champs de valeurs entières
peuvent être incrémentés durant la copie. Les entiers trop
grand ne sont pas incrémentés toutefois. Aussi, un argument
préfixé 0 désactive temporairement l'incrément. Cette touche
est aussi utilisée par décalage de sélection et les modes
reliés (voir Section 15.12.2 [Conflicts]). 
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> Divers</h4>
<div class="outline-text-4" id="text-3-1-6">
<dl class="org-dl">
<dt> <code>C-c `</code> (<code>org-table-edit-field</code>) </dt><dd>Edite le champ courant dans
une fenêtre séparée. Ceci est utile pour des champs qui ne
sont pas pleinement visibles (voir Section 3.2 [Column Width
and Alignment]). Lorsqu'appelée avec un préfixe <code>C-u</code>, fait
la fenêtre de l'éditeur suivre le point à travers le tableau
et montre toujours le champ courant. Le mode suivi sort
automatiquement lorsque le point quitte le tableau, ou quand
vous répétez la command avec <code>C-u C-u C-c `</code>.
</dd>
<dt> <code>M-x org-table-import</code> </dt><dd>Importe un fichier en tant que
tableau. Le tableau devrait être <code>TAB</code> ou séparé avec des
espaces blancs. Utilisez par exemple, pour importer un
tableau excel ou des données depuis une base de données,
parce ces programmes peuvent généralement écrire des fichiers
de texte séparés par des tabulations. Cette commande
fonctionne par insertion du fichier dans le tampon et ensuite
convertit la région en un tableau. Tout argument préfixé
est passé au convertisseur, qui l'utilise pour déterminer le
séparateur.  
</dd>
<dt> <code>C-c |</code> (<code>org-table-create-or-convert-from-region</code>) </dt><dd>Les
tableaux peuvent aussi être importés en collant des tableaux
de texte dans le tampon Org, sélectionnant le texte collé
avec <code>C-x C-x</code> et ensuite en utilisant la commande <code>C-c |</code>
(voir [Creation and conversion]). 
</dd>
<dt> <code>M-x org-table-export</code> </dt><dd>Exporte le tableau, par défaut comme
un fichier séparé par des tabulations. Utiliser pour échanger
des données avec, par exemple, un tableur ou des programmes
de base de données. Le format utilisé pour exporter le
fichier peut être configuré dans la variable
<code>org-table-export-default-format</code>. Vous pouvez aussi utiliser
'<code>TABLE_EXPORT_FILE</code>' et '<code>TABLE_EXPORT_FORMAT</code>' pour
spécifier le nom de fichier et le format exporter un tableau
dans une sous-arborescence.Org supporte les formats généraux
pour les tableaux exportés. Le format de l'exportateur est le
même que celui utilisé par les tableaux radio Orgtbl, voir
Section A.5.3 [Translator functions], pour une description
détaillée.    
</dd>
</dl>
</div>
</div>
</div>
