org-manual.org
** Largeur de colonne et alignement
   La largeur des colonnes est automatiquement déterminée par
   l'éditeur de tableau. L'alignement d'une colonne est déterminé
   automatiquement à partir de la fraction de champs numériques ou non
   numériques de la colonne. 

   Editer un champ peut modifier l'alignement du tableau. Déplacer une
   ligne ou une colonne contigue---i.e, utiliser =TAB= ou =RET=---le
   ré-aligne automatiquement. Si vous voulez désactiver ce
   comportement, configurer =org-table-automatic-realign= à
   =nil=. Dans tous les cas, vous pouvez toujours aligner manuellement
   un tableau :
   + =C-c C-c= (=org-table-align=) :: Aligne le tableau courant. 


   Configurer l'option =org-startup-align-all-tables= ré-aligne tous
   les tableaux dans un fichier lors de sa visite. Vous pouvez aussi
   configurer cette option par fichier avec : 	
   #+BEGIN_SRC org
     ,#+STARTUP: align
     ,#+STARTUP: noalign
   #+END_SRC
   Parfois, un seul champ ou quelques champs doivent contenir plus de
   texte, ce qui entraîne des colonnes trop larges. Peut-être vous
   voulez cacher plusieurs colonnes ou les afficher avec une largeur
   fixée, peu importe le contenu, comme montré dans l'exemple. 
   #+BEGIN_SRC org
     |---+--------+----------|
     |   | <6>    |          |
     | 1 | un     | peu      |
     | 2 | deux   | ennuyeux |
     | 3 | Ceci est un long texte | colonne  |
   #+END_SRC
   Pour configurer la largeur d'une colonne, un champ n'importe où
   dans la colonne peut contenir juste la chaîne '=<N>=' où N spécifie
   la largeur comme nombre de caractères. Vous pouvez contrôler la
   largeur d'affichée des colonnes avec les outils suivants :
   + =C-c TAB= (=org-table-toggle-column-width=) :: Réduis ou agrandis
        la colonne actuelle. 

	Si la largeur d'un cookie spécifie une largeur W pour la
        colonne, la réduire affiche les W premiers caractères visibles
        uniquement. Autrement, la colonne est réduite à un seul
        caractère. 

	Lorsqu'appelée avant la première colonne ou après la dernière,
        demande une liste de plages de colonnes sur lesquelles opérer.
   + =C-u C-c TAB= (=org-table-shrink=) :: Réduis toutes les colonnes
        avec une largeur de colonne. Etend les autres. 
   + =C-u C-u C-c TAB= (=org-table-expand=) :: Etend toutes les
        colonnes.


   Pour voir le texte plein d'un champ réduit, maintenir la souris
   au-dessus de lui : une info-bulle montre alors le contenu complet
   du champ. Alternativement, =C-h .= (=display-local-help=) les
   révèle aussi. Par confort, toute modification proche de la partie
   réduite d'une colonne l'étend. 

   Configurer l'option =org-startup-shrink-all-tables= réduit toutes
   les colonnes contenant un large cookie dans un fichier lors de sa
   visite. Vous pouvez aussi configurer cette option par fichier
   avec : 
   =#+STARTUP: shrink=
   Si vous souhaitez remplacer l'alignement automatique des colonnes
   riches en nombres à droite et des colonnes riches en chaînes à
   gauche, vous pouvez utiliser '=<r>=', '=<c>=', ou '=<l>=' de façon
   similaire. Vous pouvez aussi combiner alignement et largeur de
   champ comme ça : '=<r10>='.

   Les lignes qui contiennent uniquement ces formatages de cookie sont
   automatiquement effacées lors de l'exportation du document. 

** Groupes de colonnes
   Lorsque Org exporte des tableaux, il le fait par défaut sans lignes
   verticales parce que c'est plus satisfaisant visuellement en
   général. Occasionnellement toutefois, des lignes verticales peuvent
   être utiles pour structurer un tableau en groupes de colonnes, plus
   comme des lignes horizontales peuvent le faire pour des groupes de
   rangées. Afin de spécifier des groupes de colonnes, vous pouvez
   utiliser une rangée spéciale où le premier champ contient
   uniquement '=/='. Les autres champs peuvent contenir soit '=<='
   pour indiquer que cette colonne devrait commencer un groupe, '=>='
   pour indiquer la fin d'une colonne, ou '=<>=' (pas d'espace entre
   '=>=' et '=>=') pour faire un groupe de colonne en soi. Lors de
   l'exportation, les limites entre groupes de colonnes sont marquées
   avec des lignes verticales. Voici un exemple :
   #+BEGIN_SRC org
     | N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
     |---+-----+-----+-----+---------+------------|
     | / |   < |     |   > |       < |          > |
     | 1 |   1 |   1 |   1 |       1 |          1 |
     | 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
     | 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
     |---+-----+-----+-----+---------+------------|
     ,#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))
   #+END_SRC
   C'est aussi suffisant de juste insérer le groupe de colonnes après
   chaque ligne verticale que vous souhaiteriez avoir :
   #+BEGIN_SRC org
     | N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
     |---+-----+-----+-----+---------+------------|
     | / | <   |     |     | <       |            |
   #+END_SRC
   
** Le mode mineur Orgtbl
   Si vous aimez la façon intuitive dont l'éditeur de tableau Org
   marche, vous pourriez vouloir l'utiliser dans d'autres modes comme
   dans le mode Text ou Mail. Le mode mineur Orgtbl rend cela
   possible. Vous pouvez toujours basculer le mode avec =M-x
   orgtbl-mode=. Pour l'activer par défaut par exemple dans le mode
   Message, utiliser :
   =(add-hook 'message-mode-hook 'turn-on-orgtbl)=

   En outre, avec une certaine configuration spéciale, il est possible
   de maintenir les tableaux dans une syntaxe arbitraire avec le mode
   Orgtbl. Par exemple, il est possible de construire des tableaux
   \LaTeX avec la facilité et la puissance sous-jacente du mode
   Orgtbl, incluant les capacités de tableur. Pour les détails, voir
   Section A.5 [Tables in Arbitrary Syntax]. 

** Le tableur
   L'éditeur de tableau fait usage du paquet Emacs Calc pour
   implémenter des capacités de tableur. Il peut aussi évaluer des
   formules Emacs Lisp pour dériver des champs d'autres champs. Bien
   que plein d'options, l'implémentation Org n'est pas identiques aux
   autres tableurs. Par exemple, Org connaît le concept de /formule de
   colonne/ qui sera appliquée à tous les champs hors en-tête dans une
   colonne sans avoir à copier la formule pour chaque champ
   pertinent. Il y a aussi une formule de débogage, et un éditeur de
   formule, déplaçant ces références avec les touches flèches. 
*** Références
    Pour calculer les champs dans le tableau à partir d'autres champs,
    les formules doivent faire référence à d'autres champs ou
    plages. Dans Org, des champs peuvent être référencées par nom, par
    coordonnées absolues, et par coordonnées relatives. Pour découvrir
    queles sont les coordonnées d'un champ, pressez =C-c ?= dans ce
    champ, ou pressez =C-c —}= pour basculer l'affichage d'une grille.
