org-manual.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Largeur de colonne et alignement</h3>
<div class="outline-text-3" id="text-3-2">
<p>
La largeur des colonnes est automatiquement déterminée par
l'éditeur de tableau. L'alignement d'une colonne est déterminé
automatiquement à partir de la fraction de champs numériques ou non
numériques de la colonne. 
</p>

<p>
Editer un champ peut modifier l'alignement du tableau. Déplacer une
ligne ou une colonne contigue&#x2014;i.e, utiliser <code>TAB</code> ou <code>RET</code>&#x2014;le
ré-aligne automatiquement. Si vous voulez désactiver ce
comportement, configurer <code>org-table-automatic-realign</code> à
<code>nil</code>. Dans tous les cas, vous pouvez toujours aligner manuellement
un tableau :
</p>
<dl class="org-dl">
<dt> <code>C-c C-c</code> (<code>org-table-align</code>) </dt><dd>Aligne le tableau courant. 
</dd>
</dl>


<p>
Configurer l'option <code>org-startup-align-all-tables</code> ré-aligne tous
les tableaux dans un fichier lors de sa visite. Vous pouvez aussi
configurer cette option par fichier avec : 	
</p>
<div class="org-src-container">

<pre class="src src-org">#+STARTUP: align
#+STARTUP: noalign
</pre>
</div>
<p>
Parfois, un seul champ ou quelques champs doivent contenir plus de
texte, ce qui entraîne des colonnes trop larges. Peut-être vous
voulez cacher plusieurs colonnes ou les afficher avec une largeur
fixée, peu importe le contenu, comme montré dans l'exemple. 
</p>
<div class="org-src-container">

<pre class="src src-org">|---+--------+----------|
|   | &lt;6&gt;    |          |
| 1 | un     | peu      |
| 2 | deux   | ennuyeux |
| 3 | Ceci est un long texte | colonne  |
</pre>
</div>
<p>
Pour configurer la largeur d'une colonne, un champ n'importe où
dans la colonne peut contenir juste la chaîne '<code>&lt;N&gt;</code>' où N spécifie
la largeur comme nombre de caractères. Vous pouvez contrôler la
largeur d'affichée des colonnes avec les outils suivants :
</p>
<dl class="org-dl">
<dt> <code>C-c TAB</code> (<code>org-table-toggle-column-width</code>) </dt><dd>Réduis ou agrandis
la colonne actuelle. 

<p>
Si la largeur d'un cookie spécifie une largeur W pour la
colonne, la réduire affiche les W premiers caractères visibles
uniquement. Autrement, la colonne est réduite à un seul
caractère. 
</p>

<p>
Lorsqu'appelée avant la première colonne ou après la dernière,
demande une liste de plages de colonnes sur lesquelles opérer.
</p>
</dd>
<dt> <code>C-u C-c TAB</code> (<code>org-table-shrink</code>) </dt><dd>Réduis toutes les colonnes
avec une largeur de colonne. Etend les autres. 
</dd>
<dt> <code>C-u C-u C-c TAB</code> (<code>org-table-expand</code>) </dt><dd>Etend toutes les
colonnes.
</dd>
</dl>


<p>
Pour voir le texte plein d'un champ réduit, maintenir la souris
au-dessus de lui : une info-bulle montre alors le contenu complet
du champ. Alternativement, <code>C-h .</code> (<code>display-local-help</code>) les
révèle aussi. Par confort, toute modification proche de la partie
réduite d'une colonne l'étend. 
</p>

<p>
Configurer l'option <code>org-startup-shrink-all-tables</code> réduit toutes
les colonnes contenant un large cookie dans un fichier lors de sa
visite. Vous pouvez aussi configurer cette option par fichier
avec : 
<code>#+STARTUP: shrink</code>
Si vous souhaitez remplacer l'alignement automatique des colonnes
riches en nombres à droite et des colonnes riches en chaînes à
gauche, vous pouvez utiliser '<code>&lt;r&gt;</code>', '<code>&lt;c&gt;</code>', ou '<code>&lt;l&gt;</code>' de façon
similaire. Vous pouvez aussi combiner alignement et largeur de
champ comme ça : '<code>&lt;r10&gt;</code>'.
</p>

<p>
Les lignes qui contiennent uniquement ces formatages de cookie sont
automatiquement effacées lors de l'exportation du document. 
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Groupes de colonnes</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Lorsque Org exporte des tableaux, il le fait par défaut sans lignes
verticales parce que c'est plus satisfaisant visuellement en
général. Occasionnellement toutefois, des lignes verticales peuvent
être utiles pour structurer un tableau en groupes de colonnes, plus
comme des lignes horizontales peuvent le faire pour des groupes de
rangées. Afin de spécifier des groupes de colonnes, vous pouvez
utiliser une rangée spéciale où le premier champ contient
uniquement '<code>/</code>'. Les autres champs peuvent contenir soit '<code>&lt;</code>'
pour indiquer que cette colonne devrait commencer un groupe, '<code>&gt;</code>'
pour indiquer la fin d'une colonne, ou '<code>&lt;&gt;</code>' (pas d'espace entre
'<code>&gt;</code>' et '<code>&gt;</code>') pour faire un groupe de colonne en soi. Lors de
l'exportation, les limites entre groupes de colonnes sont marquées
avec des lignes verticales. Voici un exemple :
</p>
<div class="org-src-container">

<pre class="src src-org">| N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|---+-----+-----+-----+---------+------------|
| / |   &lt; |     |   &gt; |       &lt; |          &gt; |
| 1 |   1 |   1 |   1 |       1 |          1 |
| 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
| 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
|---+-----+-----+-----+---------+------------|
#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))
</pre>
</div>
<p>
C'est aussi suffisant de juste insérer le groupe de colonnes après
chaque ligne verticale que vous souhaiteriez avoir :
</p>
<div class="org-src-container">

<pre class="src src-org">| N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|---+-----+-----+-----+---------+------------|
| / | &lt;   |     |     | &lt;       |            |
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Le mode mineur Orgtbl</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Si vous aimez la façon intuitive dont l'éditeur de tableau Org
marche, vous pourriez vouloir l'utiliser dans d'autres modes comme
dans le mode Text ou Mail. Le mode mineur Orgtbl rend cela
possible. Vous pouvez toujours basculer le mode avec <code>M-x
   orgtbl-mode</code>. Pour l'activer par défaut par exemple dans le mode
Message, utiliser :
<code>(add-hook 'message-mode-hook 'turn-on-orgtbl)</code>
</p>

<p>
En outre, avec une certaine configuration spéciale, il est possible
de maintenir les tableaux dans une syntaxe arbitraire avec le mode
Orgtbl. Par exemple, il est possible de construire des tableaux
\LaTeX avec la facilité et la puissance sous-jacente du mode
Orgtbl, incluant les capacités de tableur. Pour les détails, voir
Section A.5 [Tables in Arbitrary Syntax]. 
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Le tableur</h3>
<div class="outline-text-3" id="text-3-5">
<p>
L'éditeur de tableau fait usage du paquet Emacs Calc pour
implémenter des capacités de tableur. Il peut aussi évaluer des
formules Emacs Lisp pour dériver des champs d'autres champs. Bien
que plein d'options, l'implémentation Org n'est pas identiques aux
autres tableurs. Par exemple, Org connaît le concept de <i>formule de
colonne</i> qui sera appliquée à tous les champs hors en-tête dans une
colonne sans avoir à copier la formule pour chaque champ
pertinent. Il y a aussi une formule de débogage, et un éditeur de
formule, déplaçant ces références avec les touches flèches. 
</p>
</div>
<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Références</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Pour calculer les champs dans le tableau à partir d'autres champs,
les formules doivent faire référence à d'autres champs ou
plages. Dans Org, des champs peuvent être référencées par nom, par
coordonnées absolues, et par coordonnées relatives. Pour découvrir
queles sont les coordonnées d'un champ, pressez <code>C-c ?</code> dans ce
champ, ou pressez <code>C-c —}</code> pour basculer l'affichage d'une grille.
</p>
</div>
<ol class="org-ol"><li><a id="sec-3-5-1-1" name="sec-3-5-1-1"></a>Références de champ<br ><div class="outline-text-5" id="text-3-5-1-1">
<p>
