org-manual.org
**** Références de champ 
     Les formules peuvent référencer la valeur d'un autre champs de
     deux façons. Comme dans tout autre tableur, vous pouvez
     référencer les champs par des combinaisons lettre/nombre comme
     '=B3=', signifiant le second champ dans la troisième
     ligne. Néanmoins, Org préfère utiliser une autre représentation
     plus générale qui ressemble à[fn:20] :
     
     =@ROW$COLUMN=
     
     Les spécifications de colonnes peuvent être absolues comme
     '=$1=', '=$2=', ..., '=$N=', ou relative à la colonne courante,
     i.e, la colonne du champ qui est calculé, comme '=$+1=' ou
     '=$-2='. '=$<=' et '=$>=' sont des références immuables pour la
     1ère et la dernière colonne, respectivement, et vous pouvez
     utiliser '=$>>>=' pour indiquer la 3ème colonne depuis la droite.

     La spécification de rangée compte uniquement les lignes avec des
     données et ignore les séparateurs horizontaux, ou "hlines". Comme
     avec les colonnes, vous pouvez utiliser des numéros absolus de
     rangées '=@1=', '=@2=', ..., '=@N=', et des numéros relatifs à la
     rangée en cours comme '=@+3=' ou '=@-1='. '=@<=' et '=@>=' sont
     des références immuables à la 1ère et dernière rangée dans le
     tableau, respectivement. Vous pouvez aussi spécifier la rangée
     relative à une des hlines : '=@I=' se réfère à la 1ère hline,
     '=@II=' à la seconde, etc. '=@-I=' se réfère à la 1ère telle
     ligne au dessus de la ligne actuelle, '=@+I=' à la 1ère telle
     ligne au dessous de la ligne actuelle. Vous pouvez aussi écrire
     '=@III+2=' qui est la seconde ligne de donnée après la 3ème hline
     dans le tableau. 

     '=@0=' et '=$0=' se réfèrent à la ligne et la colonne actuelles,
     respectivement, i.e, à la ligne/colonne du champ qui est
     calculé. Aussi, si vous omettez soit la colonne soit la ligne de
     la référence, l'actuelle ligne/colonne est impliquée.

     Les références Org utilisent des nombres /non signés/ qui sont
     des références fixées dans le sens où si vous utilisez la même
     référence dans la formule pour deux champs différents, le même
     champ est référencé à chaque fois. Les références Org avec des
     nombres /signés/ sont des références flottantes parce que le même
     opérateur de référence peut référencer différent champ selon le
     chaque qui est calculé par la formule.

     Voici quelques exemples :

     | '=@2$3='   | 2e ligne, 3e colonne (idem que '=C2=')                           |
     | '=$5='     | colonne 5 dans la ligne actuelle (idem que '=E&=')               |
     | '=@2'=     | colonne actuelle, ligne 2                                        |
     | '=@-1$-3=' | champ une ligne au dessus, trois colonnes à gauche               |
     | '=@-I$2='  | champ juste sous hline au dessus de la ligne actuelle, colonne 2 |
     | '=@>$5='   | champ dans la dernière ligne, colonne 5                          |

**** Références de plages
     Vous pouvez référencer une plage rectangulaire de champs en
     spécifiant deux champs de références connectées par deux points
     '=..='. Si les deux champs sont dans la ligne en cours, vous
     pouvez simplement utiliser '=$2..$7=', mais si au moins un champ
     est dans une ligne différente, vous devez utiliser le format
     général '=@ROW$COLUMN=' au moins pour le premier champ, i.e, la
     référence doit démarrer avec '=@=' afin d'être interprétée
     correctement. Exemples :
     | '=$1..$3='      | premier trois champs dans la ligne courante                       |
     | '=$P..$Q='      | plage, utilisant noms de colonnes                                 |
     | '=$<<<..$>>='   | démarre en colonne 3, continue jusqu'à la dernière                |
     | '=@2$1..@4$3='  | 6 champs entre ces 2 (idem que '=A2..C4=')                        |
     | '=@-1$-2..@-1=' | 3 champs dans la rangée au dessus, commençant 2 colonnes à gauche |
     | '=@I..II='      | entre la 1ère et la 2de hline, raccourci pour '=@I..@II='         |

     La plage de références renvoie un vecteur de valeurs qui peuvent
     être introduites en vecteur de fonctions Calc. Les champs libres
     dans les plages sont normalement supprimés, de sorte que le
     vecteur contienne uniquement des champs non-vides. Pour d'autres
     options avec le switche '=E=', '=N=' et des exemples, voir
     Section 3.5.2 [Formula syntax for Calc].

**** Coordonnées des champs dans les formules
     L'une des toutes premières actions durant l'évaluation des
     formules Calc et des formules Lisp et de substituer '=@#=' et
     '=$#=' dans la formule avec le numéro de ligne ou colonne du
     champ où le résultat ira. Les formules Lisp traditionnelles
     équivalentes sont =org-table-current-dline= et
     =org-table-current-column=. Exemples :
     + '=if(@# % 2, $#, string(""))=' :: insère un numéro de colonne
          sur les lignes impaires, configure le champ à vide même sur
          les lignes paires.
     + '~$2 = '(identity remote(FOO, @@#$1))~' :: copie le texte ou
          les valeurs de chaque rangée de la colonne 1 du tableau
          nommé FOO dans la colonne 2 du tableau courant.
     + '~@3 = * remote(FOO, @@1$$#)~' :: insère la valeur doublée de
          chaque colonne de la ligne 1 du tableau nommé FOO dans la
          rangée 3 du tableau courant. 

  
     Pour les 2e et 3e exemples, le tableau FOO doit avoir au moins
     autant de lignes ou colonnes que le tableau actuel. Noter que
     c'est inefficace[fn:21] pour un grand nombre de lignes.

**** Références nommées
     '=$name=' est interprété comme le nom d'une colonne, paramètre ou
     constante. Les constantes sont définies globalement via la
     variable =org-table-formula-constants=, et localement---pour le
     fichier---via une ligne comme cet exemple :

     =#+CONSTANTS: c=299792458. pi=3.14 eps=2.4e-6=

     Aussi, les propriétés (voir Chapitre 7 [Properties and Columns])
     peuvent être utilisées comme constantes dans des formules de
     tableaux : pour une propriété '=Xyz=' utiliser le nom
     '=$PROP_Xyz=', et la propriété sera cherchée dans l'entrée
     hiérarchique actuelle et dans la hiérarchie au dessus. Si vous
     avez le paquet '=constants.el=', il sera aussi utilisé pour
     résoudre les constantes, incluant des constantes naturelles comme
     '=$h=' pour la constante de Planck, et des unités comme '=$km='
     pour les kilomètres[fn:22]. Les noms de colonnes et les
     paramètres peuvent être spécifié dans des lignes spéciales de
     tableau. Elles sont décrites plus bas, voir Section 3.5.10
     [Advanced features]. Tous les noms doivent commencer par une
     lettre, et les autres constitué de lettres et de nombres.

