org-manual.html
Les formules peuvent référencer la valeur d'un autre champs de
deux façons. Comme dans tout autre tableur, vous pouvez
référencer les champs par des combinaisons lettre/nombre comme
'<code>B3</code>', signifiant le second champ dans la troisième
ligne. Néanmoins, Org préfère utiliser une autre représentation
plus générale qui ressemble à<sup><a id="fnr.20" name="fnr.20" class="footref" href="#fn.20">20</a></sup> :
</p>

<p>
<code>@ROW$COLUMN</code>
</p>

<p>
Les spécifications de colonnes peuvent être absolues comme
'<code>$1</code>', '<code>$2</code>', &#x2026;, '<code>$N</code>', ou relative à la colonne courante,
i.e, la colonne du champ qui est calculé, comme '<code>$+1</code>' ou
'<code>$-2</code>'. '<code>$&lt;</code>' et '<code>$&gt;</code>' sont des références immuables pour la
1ère et la dernière colonne, respectivement, et vous pouvez
utiliser '<code>$&gt;&gt;&gt;</code>' pour indiquer la 3ème colonne depuis la droite.
</p>

<p>
La spécification de rangée compte uniquement les lignes avec des
données et ignore les séparateurs horizontaux, ou "hlines". Comme
avec les colonnes, vous pouvez utiliser des numéros absolus de
rangées '<code>@1</code>', '<code>@2</code>', &#x2026;, '<code>@N</code>', et des numéros relatifs à la
rangée en cours comme '<code>@+3</code>' ou '<code>@-1</code>'. '<code>@&lt;</code>' et '<code>@&gt;</code>' sont
des références immuables à la 1ère et dernière rangée dans le
tableau, respectivement. Vous pouvez aussi spécifier la rangée
relative à une des hlines : '<code>@I</code>' se réfère à la 1ère hline,
'<code>@II</code>' à la seconde, etc. '<code>@-I</code>' se réfère à la 1ère telle
ligne au dessus de la ligne actuelle, '<code>@+I</code>' à la 1ère telle
ligne au dessous de la ligne actuelle. Vous pouvez aussi écrire
'<code>@III+2</code>' qui est la seconde ligne de donnée après la 3ème hline
dans le tableau. 
</p>

<p>
'<code>@0</code>' et '<code>$0</code>' se réfèrent à la ligne et la colonne actuelles,
respectivement, i.e, à la ligne/colonne du champ qui est
calculé. Aussi, si vous omettez soit la colonne soit la ligne de
la référence, l'actuelle ligne/colonne est impliquée.
</p>

<p>
Les références Org utilisent des nombres <i>non signés</i> qui sont
des références fixées dans le sens où si vous utilisez la même
référence dans la formule pour deux champs différents, le même
champ est référencé à chaque fois. Les références Org avec des
nombres <i>signés</i> sont des références flottantes parce que le même
opérateur de référence peut référencer différent champ selon le
chaque qui est calculé par la formule.
</p>

<p>
Voici quelques exemples :
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left">'<code>@2$3</code>'</td>
<td class="text-left">2e ligne, 3e colonne (idem que '<code>C2</code>')</td>
</tr>

<tr>
<td class="text-left">'<code>$5</code>'</td>
<td class="text-left">colonne 5 dans la ligne actuelle (idem que '<code>E&amp;</code>')</td>
</tr>

<tr>
<td class="text-left">'<code>@2'</code></td>
<td class="text-left">colonne actuelle, ligne 2</td>
</tr>

<tr>
<td class="text-left">'<code>@-1$-3</code>'</td>
<td class="text-left">champ une ligne au dessus, trois colonnes à gauche</td>
</tr>

<tr>
<td class="text-left">'<code>@-I$2</code>'</td>
<td class="text-left">champ juste sous hline au dessus de la ligne actuelle, colonne 2</td>
</tr>

<tr>
<td class="text-left">'<code>@&gt;$5</code>'</td>
<td class="text-left">champ dans la dernière ligne, colonne 5</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-3-5-1-2" name="sec-3-5-1-2"></a>Références de plages<br ><div class="outline-text-5" id="text-3-5-1-2">
<p>
Vous pouvez référencer une plage rectangulaire de champs en
spécifiant deux champs de références connectées par deux points
'<code>..</code>'. Si les deux champs sont dans la ligne en cours, vous
pouvez simplement utiliser '<code>$2..$7</code>', mais si au moins un champ
est dans une ligne différente, vous devez utiliser le format
général '<code>@ROW$COLUMN</code>' au moins pour le premier champ, i.e, la
référence doit démarrer avec '<code>@</code>' afin d'être interprétée
correctement. Exemples :
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left">'<code>$1..$3</code>'</td>
<td class="text-left">premier trois champs dans la ligne courante</td>
</tr>

<tr>
<td class="text-left">'<code>$P..$Q</code>'</td>
<td class="text-left">plage, utilisant noms de colonnes</td>
</tr>

<tr>
<td class="text-left">'<code>$&lt;&lt;&lt;..$&gt;&gt;</code>'</td>
<td class="text-left">démarre en colonne 3, continue jusqu'à la dernière</td>
</tr>

<tr>
<td class="text-left">'<code>@2$1..@4$3</code>'</td>
<td class="text-left">6 champs entre ces 2 (idem que '<code>A2..C4</code>')</td>
</tr>

<tr>
<td class="text-left">'<code>@-1$-2..@-1</code>'</td>
<td class="text-left">3 champs dans la rangée au dessus, commençant 2 colonnes à gauche</td>
</tr>

<tr>
<td class="text-left">'<code>@I..II</code>'</td>
<td class="text-left">entre la 1ère et la 2de hline, raccourci pour '<code>@I..@II</code>'</td>
</tr>
</tbody>
</table>

<p>
La plage de références renvoie un vecteur de valeurs qui peuvent
être introduites en vecteur de fonctions Calc. Les champs libres
dans les plages sont normalement supprimés, de sorte que le
vecteur contienne uniquement des champs non-vides. Pour d'autres
options avec le switche '<code>E</code>', '<code>N</code>' et des exemples, voir
Section 3.5.2 [Formula syntax for Calc].
</p>
</div>
</li>

<li><a id="sec-3-5-1-3" name="sec-3-5-1-3"></a>Coordonnées des champs dans les formules<br ><div class="outline-text-5" id="text-3-5-1-3">
<p>
L'une des toutes premières actions durant l'évaluation des
formules Calc et des formules Lisp et de substituer '<code>@#</code>' et
'<code>$#</code>' dans la formule avec le numéro de ligne ou colonne du
champ où le résultat ira. Les formules Lisp traditionnelles
équivalentes sont <code>org-table-current-dline</code> et
<code>org-table-current-column</code>. Exemples :
</p>
<dl class="org-dl">
<dt> '<code>if(@# % 2, $#, string(""))</code>' </dt><dd>insère un numéro de colonne
sur les lignes impaires, configure le champ à vide même sur
les lignes paires.
</dd>
<dt> '<code>$2 = '(identity remote(FOO, @@#$1))</code>' </dt><dd>copie le texte ou
les valeurs de chaque rangée de la colonne 1 du tableau
nommé FOO dans la colonne 2 du tableau courant.
</dd>
<dt> '<code>@3 = * remote(FOO, @@1$$#)</code>' </dt><dd>insère la valeur doublée de
chaque colonne de la ligne 1 du tableau nommé FOO dans la
rangée 3 du tableau courant. 
</dd>
</dl>


<p>
Pour les 2e et 3e exemples, le tableau FOO doit avoir au moins
autant de lignes ou colonnes que le tableau actuel. Noter que
c'est inefficace<sup><a id="fnr.21" name="fnr.21" class="footref" href="#fn.21">21</a></sup> pour un grand nombre de lignes.
</p>
</div>
</li>

<li><a id="sec-3-5-1-4" name="sec-3-5-1-4"></a>Références nommées<br ><div class="outline-text-5" id="text-3-5-1-4">
<p>
'<code>$name</code>' est interprété comme le nom d'une colonne, paramètre ou
constante. Les constantes sont définies globalement via la
variable <code>org-table-formula-constants</code>, et localement&#x2014;pour le
fichier&#x2014;via une ligne comme cet exemple :
</p>

<p>
<code>#+CONSTANTS: c=299792458. pi=3.14 eps=2.4e-6</code>
</p>

<p>
Aussi, les propriétés (voir Chapitre 7 [Properties and Columns])
peuvent être utilisées comme constantes dans des formules de
tableaux : pour une propriété '<code>Xyz</code>' utiliser le nom
'<code>$PROP_Xyz</code>', et la propriété sera cherchée dans l'entrée
hiérarchique actuelle et dans la hiérarchie au dessus. Si vous
avez le paquet '<code>constants.el</code>', il sera aussi utilisé pour
résoudre les constantes, incluant des constantes naturelles comme
'<code>$h</code>' pour la constante de Planck, et des unités comme '<code>$km</code>'
pour les kilomètres<sup><a id="fnr.22" name="fnr.22" class="footref" href="#fn.22">22</a></sup>. Les noms de colonnes et les
paramètres peuvent être spécifié dans des lignes spéciales de
tableau. Elles sont décrites plus bas, voir Section 3.5.10
[Advanced features]. Tous les noms doivent commencer par une
lettre, et les autres constitué de lettres et de nombres.
</p>
</div>
</li>
