org-manual.html


<div id="outline-container-sec-3-5-6" class="outline-4">
<h4 id="sec-3-5-6"><span class="section-number-4">3.5.6</span> Formules de colonnes</h4>
<div class="outline-text-4" id="text-3-5-6">
<p>
Lorsque vous assignez une formule à une simple référence de
colonne comme '<code>$3</code>', la même formule est utilisée dans tous les
champs pour cette colonne, avec les exceptions très pratiques
suivantes : (i) Si le tableau contient des séparateurs horizontaux
hlines avec des lignes au dessus et au dessous, tout avant la
première telle hline est considéré comme partie de la <i>tête</i> du
tableau et n'est pas modifié par les formules de colonnes. Ainsi
une tête est requise lorsque vous utilisez des formules de
colonnes et voulez ajouter des hlines à des groupes de lignes,
comme par exemple pour séparer un total de ligne en bas des lignes
sommées au dessus. (ii) Les champs qui ont déjà une valeur depuis
une formule de champ/plage sont laissées tranquilles par les
formules de colonnes. Ces conditions rendent les formules de
colonnes très faciles à utiliser. 
</p>

<p>
Pour assigner une formule à une colonne, tapez la directement dans
n'importe quel champ de la colonne, précédée par un signe égal,
comme '<code>=$1+$2</code>'. Lorsque vous pressez <code>TAB</code> ou <code>RET</code> ou <code>C-c C-c</code>
avec le point encore dans le champ, la formule est stockée comme
formule pour la colonne courante, évaluée et le champ courant est
remplacé par le résultat. Si le champ contient uniquement '<code>=</code>',
la forumule précédemment stockée est utilisée. Pour chaque
colonne, Org se rappelle uniquement la formule utilisée la plus
récente. Dans le mot-clé '<code>TBLFM</code>', des formules de colonnes
ressemblent à '<code>$4=$1+$2</code>'. Le membre de gauche d'une formule de
colonne peut être le nom de colonne, ce doit être la référence
numérique de la colonne ou '<code>$&gt;</code>'. 
</p>

<p>
Au lieu de taper une équation dans le champ, vous pouvez aussi
utiliser la commande suivante :
</p>

<dl class="org-dl">
<dt> <code>C-c =</code> (<code>org-table-eval-formula</code>) </dt><dd>Installe une nouvelle
formule dans la colonne courante et remplace le champ courant
avec le résultat de la formule. La commande invite à saisir
une formule, avec par défaut le mot-clé '<code>TBLFM</code>', l'applique
au champ courante et la stocke. Avec un argument préfixé, par
exemple, <code>C-5 C-c =</code>, la commande l'applique à ces champs
consécutifs dans la colonne courante. 
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-3-5-7" class="outline-4">
<h4 id="sec-3-5-7"><span class="section-number-4">3.5.7</span> Fonctions de recherche</h4>
</div>
</div>
</div>
